[Killed] EqualityOperator
main/components/Commons/CommonsCardv2.jsx:25:21
                 className="buttonchange"
                 onClick={() => {
                   if (
-                    buttonText === "Join" &&
+                    buttonText !== "Join" &&
                     isFutureDate(commons.startingDate)
                   ) {
killedBy: CommonsCardv2 tests cannot join commons with future start date - future year
statusReason: expected "spy" to be called +0 times, but got 1 times
