[Killed] EqualityOperator
main/components/Commons/CommonsListv2.jsx:38:8
       >
         {props.title}
       </Card.Title>
-      {props.commonList.length > 0 ? (
+      {props.commonList.length <= 0 ? (
         <React.Fragment>
           <Card.Subtitle>
killedBy: CommonsList tests renders without crashing when button text is set
statusReason: Unable to find an element by: [data-testid="commonsList-subtitle-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="my-3 card"
      style="opacity: 1; background-color: rgb(147, 98, 66); color: rgb(245, 210, 140); border: 6px solid rgb(99,71,52);"

[Killed] ArrowFunction
main/components/Commons/CommonsListv2.jsx:67:33
               </Row>
             </Container>
           </Card.Subtitle>
-          {props.commonList.map((c) => (
-            <CommonsCardv2
-              key={c.id}
-              commons={c}
-              buttonText={props.buttonText}
-              buttonLink={props.buttonLink}
-            />
-          ))}
+          {props.commonList.map(() => undefined)}
         </React.Fragment>
       ) : (
killedBy: CommonsList tests renders without crashing when button text is set
statusReason: Unable to find an element by: [data-testid="/commonsCard-button/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="my-3 card"
      style="opacity: 1; background-color: rgb(147, 98, 66); color: rgb(245, 210, 140); border: 6px solid rgb(99,71,52);"
