[Killed] ConditionalExpression
src/main/components/OurTable.jsx:42:43
     );
 
   const tableProps = getTableProps();
-  const { key: tableKey, ...tableRest } = tableProps || {};
+  const { key: tableKey, ...tableRest } = true;
   const bodyProps = getTableBodyProps();
   const { key: bodyKey, ...bodyRest } = bodyProps || {};
killedBy: OurTable extra coverage renders when react-table props provide explicit keys
statusReason: expect(element).toHaveAttribute("data-hello", "x") // element.getAttribute("data-hello") === "x"

Expected the element to have attribute:
  data-hello="x"
Received:
  null

[Killed] LogicalOperator
src/main/components/OurTable.jsx:42:43
     );
 
   const tableProps = getTableProps();
-  const { key: tableKey, ...tableRest } = tableProps || {};
+  const { key: tableKey, ...tableRest } = tableProps && {};
   const bodyProps = getTableBodyProps();
   const { key: bodyKey, ...bodyRest } = bodyProps || {};
killedBy: OurTable extra coverage renders fallback branches when react-table props are undefined
statusReason: Cannot destructure property 'key' of '(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:44:41
   const tableProps = getTableProps();
   const { key: tableKey, ...tableRest } = tableProps || {};
   const bodyProps = getTableBodyProps();
-  const { key: bodyKey, ...bodyRest } = bodyProps || {};
+  const { key: bodyKey, ...bodyRest } = true;
 
   return (
killedBy: OurTable extra coverage renders when react-table props provide explicit keys
statusReason: expect(element).toHaveAttribute("data-body", "B") // element.getAttribute("data-body") === "B"

Expected the element to have attribute:
  data-body="B"
Received:
  null

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:44:41
   const tableProps = getTableProps();
   const { key: tableKey, ...tableRest } = tableProps || {};
   const bodyProps = getTableBodyProps();
-  const { key: bodyKey, ...bodyRest } = bodyProps || {};
+  const { key: bodyKey, ...bodyRest } = false;
 
   return (
killedBy: OurTable extra coverage renders when react-table props provide explicit keys
statusReason: expect(element).toHaveAttribute("data-body", "B") // element.getAttribute("data-body") === "B"

Expected the element to have attribute:
  data-body="B"
Received:
  null

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:59:47
         <thead>
           {headerGroups.map((headerGroup, hgIndex) => {
             const hgProps = headerGroup.getHeaderGroupProps();
-            const { key: hgKey, ...hgRest } = hgProps || {};
+            const { key: hgKey, ...hgRest } = true;
             const safeHgKey = hgKey ?? `headergroup-${hgIndex}`;
             return (
killedBy: OurTable extra coverage renders when react-table props provide explicit keys
statusReason: expected 'headergroup-0' to be 'HG-0' // Object.is equality

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:59:47
         <thead>
           {headerGroups.map((headerGroup, hgIndex) => {
             const hgProps = headerGroup.getHeaderGroupProps();
-            const { key: hgKey, ...hgRest } = hgProps || {};
+            const { key: hgKey, ...hgRest } = false;
             const safeHgKey = hgKey ?? `headergroup-${hgIndex}`;
             return (
killedBy: OurTable extra coverage renders when react-table props provide explicit keys
statusReason: expected 'headergroup-0' to be 'HG-0' // Object.is equality

[Killed] LogicalOperator
src/main/components/OurTable.jsx:60:31
           {headerGroups.map((headerGroup, hgIndex) => {
             const hgProps = headerGroup.getHeaderGroupProps();
             const { key: hgKey, ...hgRest } = hgProps || {};
-            const safeHgKey = hgKey ?? `headergroup-${hgIndex}`;
+            const safeHgKey = hgKey && `headergroup-${hgIndex}`;
             return (
               <tr {...hgRest} key={safeHgKey} data-fallback-key={safeHgKey}>
killedBy: OurTable extra coverage renders fallback data-fallback-key attributes when props lack keys
statusReason: expect(element).toHaveAttribute("data-fallback-key", "headergroup-0") // element.getAttribute("data-fallback-key") === "headergroup-0"

Expected the element to have attribute:
  data-fallback-key="headergroup-0"
Received:
  null

[Killed] StringLiteral
src/main/components/OurTable.jsx:60:40
           {headerGroups.map((headerGroup, hgIndex) => {
             const hgProps = headerGroup.getHeaderGroupProps();
             const { key: hgKey, ...hgRest } = hgProps || {};
-            const safeHgKey = hgKey ?? `headergroup-${hgIndex}`;
+            const safeHgKey = hgKey ?? ``;
             return (
               <tr {...hgRest} key={safeHgKey} data-fallback-key={safeHgKey}>
killedBy: OurTable extra coverage renders fallback data-fallback-key attributes when props lack keys
statusReason: expect(element).toHaveAttribute("data-fallback-key", "headergroup-0") // element.getAttribute("data-fallback-key") === "headergroup-0"

Expected the element to have attribute:
  data-fallback-key="headergroup-0"
Received:
  data-fallback-key=""

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:67:55
                   const colProps = column.getHeaderProps(
                     column.getSortByToggleProps(),
                   );
-                  const { key: colKey, ...colRest } = colProps || {};
+                  const { key: colKey, ...colRest } = true;
                   const safeColKey = colKey ?? `col-${column.id ?? colIndex}`;
                   return (
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: 🔼. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:67:55
                   const colProps = column.getHeaderProps(
                     column.getSortByToggleProps(),
                   );
-                  const { key: colKey, ...colRest } = colProps || {};
+                  const { key: colKey, ...colRest } = false;
                   const safeColKey = colKey ?? `col-${column.id ?? colIndex}`;
                   return (
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: Unable to find an element with the text: 🔼. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] LogicalOperator
src/main/components/OurTable.jsx:68:55
                     column.getSortByToggleProps(),
                   );
                   const { key: colKey, ...colRest } = colProps || {};
-                  const safeColKey = colKey ?? `col-${column.id ?? colIndex}`;
+                  const safeColKey = colKey ?? `col-${column.id && colIndex}`;
                   return (
                     <th
killedBy: OurTable extra coverage covers column.id ?? colIndex and cell.column.id ?? cellIndex fallbacks
statusReason: expect(element).toHaveAttribute("data-fallback-key", "col-0") // element.getAttribute("data-fallback-key") === "col-0"

Expected the element to have attribute:
  data-fallback-key="col-0"
Received:
  data-fallback-key="col-undefined"

[Killed] LogicalOperator
src/main/components/OurTable.jsx:68:38
                     column.getSortByToggleProps(),
                   );
                   const { key: colKey, ...colRest } = colProps || {};
-                  const safeColKey = colKey ?? `col-${column.id ?? colIndex}`;
+                  const safeColKey = colKey && `col-${column.id ?? colIndex}`;
                   return (
                     <th
killedBy: OurTable extra coverage covers column.id ?? colIndex and cell.column.id ?? cellIndex fallbacks
statusReason: expect(element).toHaveAttribute("data-fallback-key", "col-0") // element.getAttribute("data-fallback-key") === "col-0"

Expected the element to have attribute:
  data-fallback-key="col-0"
Received:
  null

[Killed] StringLiteral
src/main/components/OurTable.jsx:74:36
                       {...colRest}
                       key={safeColKey}
                       data-fallback-key={safeColKey}
-                      data-testid={`${testid}-header-${column.id}`}
+                      data-testid={``}
                     >
                       {column.render("Header")}
killedBy: OurTable tests default testid is testId
statusReason: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] MethodExpression
src/main/components/OurTable.jsx:95:12
           {/* headerGroups already rendered above with safe keys */}
         </thead>
         <tbody {...bodyRest} key={bodyKey}>
-          {rows
-            .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
+          {rows
             .map((row, rowIndex) => {
               prepareRow(row);
killedBy: OurTable tests renders a table with 11 rows and clicks on the next page button and previous page button
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <td
  data-fallback-key="cell_10_col1"
  data-testid="testid-cell-row-10-col-col1"
  role="cell"
>
  Hello 11

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:100:51
             .map((row, rowIndex) => {
               prepareRow(row);
               const rowProps = row.getRowProps();
-              const { key: rowKey, ...rowRest } = rowProps || {};
+              const { key: rowKey, ...rowRest } = true;
               const safeRowKey = rowKey ?? `row-${rowIndex}`;
               return (
killedBy: OurTable extra coverage real rendering uses default safe keys for headergroup/row/cell
statusReason: expect(element).toHaveAttribute("data-fallback-key", "row_0") // element.getAttribute("data-fallback-key") === "row_0"

Expected the element to have attribute:
  data-fallback-key="row_0"
Received:
  data-fallback-key="row-0"

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:100:51
             .map((row, rowIndex) => {
               prepareRow(row);
               const rowProps = row.getRowProps();
-              const { key: rowKey, ...rowRest } = rowProps || {};
+              const { key: rowKey, ...rowRest } = false;
               const safeRowKey = rowKey ?? `row-${rowIndex}`;
               return (
killedBy: OurTable extra coverage real rendering uses default safe keys for headergroup/row/cell
statusReason: expect(element).toHaveAttribute("data-fallback-key", "row_0") // element.getAttribute("data-fallback-key") === "row_0"

Expected the element to have attribute:
  data-fallback-key="row_0"
Received:
  data-fallback-key="row-0"

[Killed] LogicalOperator
src/main/components/OurTable.jsx:101:34
               prepareRow(row);
               const rowProps = row.getRowProps();
               const { key: rowKey, ...rowRest } = rowProps || {};
-              const safeRowKey = rowKey ?? `row-${rowIndex}`;
+              const safeRowKey = rowKey && `row-${rowIndex}`;
               return (
                 <tr
killedBy: OurTable extra coverage renders fallback data-fallback-key attributes when props lack keys
statusReason: expect(element).toHaveAttribute("data-fallback-key", "row-0") // element.getAttribute("data-fallback-key") === "row-0"

Expected the element to have attribute:
  data-fallback-key="row-0"
Received:
  null

[Killed] BlockStatement
src/main/components/OurTable.jsx:108:55
                   key={safeRowKey}
                   data-fallback-key={safeRowKey}
                 >
-                  {row.cells.map((cell, cellIndex) => {
-                    const cellProps = cell.getCellProps();
-                    const { key: cellKey, ...cellRest } = cellProps || {};
-                    const safeCellKey =
-                      cellKey ??
-                      `cell-${cell.row.index}-${cell.column.id ?? cellIndex}`;
-                    return (
-                      <td
-                        {...cellRest}
-                        key={safeCellKey}
-                        data-fallback-key={safeCellKey}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                      >
-                        {cell.render("Cell")}
-                      </td>
-                    );
-                  })}
+                  {row.cells.map((cell, cellIndex) => {})}
                 </tr>
               );
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:110:59
                 >
                   {row.cells.map((cell, cellIndex) => {
                     const cellProps = cell.getCellProps();
-                    const { key: cellKey, ...cellRest } = cellProps || {};
+                    const { key: cellKey, ...cellRest } = true;
                     const safeCellKey =
                       cellKey ??
killedBy: OurTable extra coverage renders when react-table props provide explicit keys
statusReason: expected 'cell-0-col1' to be 'CELL-0-0' // Object.is equality

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:110:59
                 >
                   {row.cells.map((cell, cellIndex) => {
                     const cellProps = cell.getCellProps();
-                    const { key: cellKey, ...cellRest } = cellProps || {};
+                    const { key: cellKey, ...cellRest } = false;
                     const safeCellKey =
                       cellKey ??
killedBy: OurTable extra coverage renders when react-table props provide explicit keys
statusReason: expected 'cell-0-col1' to be 'CELL-0-0' // Object.is equality

[Killed] LogicalOperator
src/main/components/OurTable.jsx:112:23
                     const cellProps = cell.getCellProps();
                     const { key: cellKey, ...cellRest } = cellProps || {};
                     const safeCellKey =
-                      cellKey ??
-                      `cell-${cell.row.index}-${cell.column.id ?? cellIndex}`;
+                      cellKey && `cell-${cell.row.index}-${cell.column.id ?? cellIndex}`;
                     return (
                       <td
killedBy: OurTable extra coverage renders fallback data-fallback-key attributes when props lack keys
statusReason: expect(element).toHaveAttribute("data-fallback-key", "cell-0-col1") // element.getAttribute("data-fallback-key") === "cell-0-col1"

Expected the element to have attribute:
  data-fallback-key="cell-0-col1"
Received:
  null

[Killed] LogicalOperator
src/main/components/OurTable.jsx:113:49
                     const { key: cellKey, ...cellRest } = cellProps || {};
                     const safeCellKey =
                       cellKey ??
-                      `cell-${cell.row.index}-${cell.column.id ?? cellIndex}`;
+                      `cell-${cell.row.index}-${cell.column.id && cellIndex}`;
                     return (
                       <td
killedBy: OurTable extra coverage renders fallback data-fallback-key attributes when props lack keys
statusReason: expect(element).toHaveAttribute("data-fallback-key", "cell-0-col1") // element.getAttribute("data-fallback-key") === "cell-0-col1"

Expected the element to have attribute:
  data-fallback-key="cell-0-col1"
Received:
  data-fallback-key="cell-0-0"
