[Killed] BlockStatement
src/main/pages/AdminEditCommonsPage.jsx:70:18
     mutation.mutate(data);
   };
 
-  if (isSuccess) {
-    return <Navigate to="/admin/listcommonsv2" />;
-  }
+  if (isSuccess) {}
 
   return (
killedBy: AdminEditCommonsPage tests tests where backend is working normally Changes when you click Update
statusReason: Found a label with the text of: /When above capacity/, however no form control was found associated to that label. Make sure you're using the "for" attribute or "aria-labelledby" attribute correctly.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
