[Killed] BooleanLiteral
main/components/Commons/CommonsTablev2.jsx:31:46
 // helper functions moved to ./commonsTableUtils to satisfy react-refresh rule
 
 export default function CommonsTablev2({ commons, currentUser }) {
-  const [showModal, setShowModal] = useState(false);
+  const [showModal, setShowModal] = useState(true);
   const [commonsToDelete, setCommonsToDelete] = useState(null);
   const [sortKey, setSortKey] = useState("commons.id");
killedBy: CommonsTablev2 component modal is hidden before delete is clicked and closes on cancel
statusReason: expect(element).not.toBeVisible()

Received element is visible:
  <div
  data-testid="CommonsTable-Modal"
/>

[Killed] BlockStatement
main/components/Commons/CommonsTablev2.jsx:46:37
 
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
 
-  const handleEdit = (commonsId) => {
-    navigate(`/admin/editcommons/${commonsId}`);
-  };
+  const handleEdit = (commonsId) => {};
 
   const handleDelete = (commonsPlus) => {
killedBy: CommonsTablev2 component Edit action navigates to edit page when adminUser (legacy hidden button)
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:47:14
   const isAdmin = hasRole(currentUser, "ROLE_ADMIN");
 
   const handleEdit = (commonsId) => {
-    navigate(`/admin/editcommons/${commonsId}`);
+    navigate(``);
   };
 
killedBy: CommonsTablev2 component Edit action navigates to edit page when adminUser (legacy hidden button)
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Received: 

  1st spy call:

  [
-   "/admin/editcommons/1",

[Killed] BlockStatement
main/components/Commons/CommonsTablev2.jsx:50:41
     navigate(`/admin/editcommons/${commonsId}`);
   };
 
-  const handleDelete = (commonsPlus) => {
-    setCommonsToDelete(commonsPlus);
-    setShowModal(true);
-  };
+  const handleDelete = (commonsPlus) => {};
 
   const confirmDelete = async () => {
killedBy: CommonsTablev2 component Legacy actions and hidden containers exist and behave (delete/modal, announcements, stats)
statusReason: Unable to find an element with the text: /Permanently Delete/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] BooleanLiteral
main/components/Commons/CommonsTablev2.jsx:52:18
 
   const handleDelete = (commonsPlus) => {
     setCommonsToDelete(commonsPlus);
-    setShowModal(true);
+    setShowModal(false);
   };
 
killedBy: CommonsTablev2 component Legacy actions and hidden containers exist and behave (delete/modal, announcements, stats)
statusReason: Unable to find an element with the text: /Permanently Delete/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] BlockStatement
main/components/Commons/CommonsTablev2.jsx:55:37
     setShowModal(true);
   };
 
-  const confirmDelete = async () => {
-    if (!commonsToDelete) return;
-    deleteMutation.mutate({
-      row: {
-        values: {
-          "commons.id": commonsToDelete.commons.id,
-        },
-      },
-    });
-    setShowModal(false);
-    setCommonsToDelete(null);
-  };
+  const confirmDelete = async () => {};
 
   const handleLeaderboard = (commonsId) => {
killedBy: CommonsTablev2 component hidden confirm-delete helper calls mutate when commonsToDelete set (kills arrow function mutant)
statusReason: expected "spy" to be called at least once

[Killed] BooleanLiteral
main/components/Commons/CommonsTablev2.jsx:56:9
   };
 
   const confirmDelete = async () => {
-    if (!commonsToDelete) return;
+    if (commonsToDelete) return;
     deleteMutation.mutate({
       row: {
killedBy: CommonsTablev2 component hidden confirm-delete helper calls mutate when commonsToDelete set (kills arrow function mutant)
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
main/components/Commons/CommonsTablev2.jsx:56:9
   };
 
   const confirmDelete = async () => {
-    if (!commonsToDelete) return;
+    if (true) return;
     deleteMutation.mutate({
       row: {
killedBy: CommonsTablev2 component hidden confirm-delete helper calls mutate when commonsToDelete set (kills arrow function mutant)
statusReason: expected "spy" to be called at least once

[Killed] ObjectLiteral
main/components/Commons/CommonsTablev2.jsx:59:17
     if (!commonsToDelete) return;
     deleteMutation.mutate({
       row: {
-        values: {
-          "commons.id": commonsToDelete.commons.id,
-        },
+        values: {},
       },
     });
killedBy: CommonsTablev2 component confirm delete calls mutate with expected payload
statusReason: expected "spy" to be called with arguments: [ { row: { values: { …(1) } } } ]

Received: 

  1st spy call:

  [
    {

[Killed] BooleanLiteral
main/components/Commons/CommonsTablev2.jsx:64:18
         },
       },
     });
-    setShowModal(false);
+    setShowModal(true);
     setCommonsToDelete(null);
   };
killedBy: CommonsTablev2 component Clicking Permanently Delete button deletes the commons
statusReason: expect(element).not.toBeVisible()

Received element is visible:
  <div
  data-testid="CommonsTable-Modal"
  style=""
/>

[Killed] BlockStatement
main/components/Commons/CommonsTablev2.jsx:68:44
     setCommonsToDelete(null);
   };
 
-  const handleLeaderboard = (commonsId) => {
-    navigate(`/leaderboard/${commonsId}`);
-  };
+  const handleLeaderboard = (commonsId) => {};
 
   const validSortKey = SORT_FIELDS.some((field) => field.key === sortKey)
killedBy: CommonsTablev2 component Leaderboard action navigates to leaderboard page when clicked (legacy hidden button)
statusReason: expected "spy" to be called with arguments: [ '/leaderboard/1' ]

Number of calls: 0

[Killed] ConditionalExpression
main/components/Commons/CommonsTablev2.jsx:72:52
     navigate(`/leaderboard/${commonsId}`);
   };
 
-  const validSortKey = SORT_FIELDS.some((field) => field.key === sortKey)
+  const validSortKey = SORT_FIELDS.some((field) => true)
     ? sortKey
     : "commons.id";
killedBy: CommonsTablev2 component invalid sort key falls back to default commons.id
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  2

[Killed] MethodExpression
main/components/Commons/CommonsTablev2.jsx:72:24
     navigate(`/leaderboard/${commonsId}`);
   };
 
-  const validSortKey = SORT_FIELDS.some((field) => field.key === sortKey)
+  const validSortKey = SORT_FIELDS.every(field => field.key === sortKey)
     ? sortKey
     : "commons.id";
killedBy: CommonsTablev2 component component numeric sorting by milkPrice ascending and descending
statusReason: expected [ 'Alpha', 'Bravo', 'Charlie' ] to deeply equal [ 'Alpha', 'Charlie', 'Bravo' ]

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:74:7
 
   const validSortKey = SORT_FIELDS.some((field) => field.key === sortKey)
     ? sortKey
-    : "commons.id";
+    : "";
 
   const comparator = useMemo(
killedBy: CommonsTablev2 component invalid sort key falls back to default commons.id
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  1
Received:
  2

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:77:5
     : "commons.id";
 
   const comparator = useMemo(
-    () => createCommonsComparator(validSortKey, sortDirection),
+    () => undefined,
     [validSortKey, sortDirection],
   );
killedBy: CommonsTablev2 component allows sorting by Name descending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
  1

[Killed] BlockStatement
main/components/Commons/CommonsTablev2.jsx:81:39
     [validSortKey, sortDirection],
   );
 
-  const sortedCommons = useMemo(() => {
-    const sorted = [...commons];
-    sorted.sort(comparator);
-    return sorted;
-  }, [commons, comparator]);
+  const sortedCommons = useMemo(() => {}, [commons, comparator]);
 
   const cards = sortedCommons.map((commonsPlus, index) => {
killedBy: CommonsTablev2 component renders without crashing for empty table with user not logged in
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] MethodExpression
main/components/Commons/CommonsTablev2.jsx:83:5
 
   const sortedCommons = useMemo(() => {
     const sorted = [...commons];
-    sorted.sort(comparator);
+    sorted;
     return sorted;
   }, [commons, comparator]);
killedBy: CommonsTablev2 component allows sorting by Name descending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
  1

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:109:22
     return (
       <Card
         key={id}
-        data-testid={`CommonsTable-card-${index}`}
+        data-testid={``}
         className="shadow-sm border-0"
       >
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-card-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:119:30
           >
             <div>
               <div
-                data-testid={`CommonsTable-card-${index}-name`}
+                data-testid={``}
                 className="h5 mb-1"
               >
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-card-1-name"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:124:32
               >
                 {/* Keep existing test id for unit tests */}
                 <span
-                  data-testid={`CommonsTable-card-${index}-field-commons.name`}
+                  data-testid={``}
                 >
                   {name}
killedBy: CommonsTablev2 component component sorting handles null vs non-null for defaults
statusReason: Unable to find an element by: [data-testid="/CommonsTable-card-\d+-field-commons.name/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:146:30
             >
               <Badge
                 bg="secondary"
-                data-testid={`CommonsTable-card-${index}-totalCows`}
+                data-testid={``}
               >
                 Tot Cows: {formatPlain(totalCows)}
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-card-1-totalCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:211:32
                 <dt className="col-sm-5 text-muted small">Starting Date</dt>
                 <dd
                   className="col-sm-7 fw-semibold"
-                  data-testid={`CommonsTable-card-${index}-field-commons.startingDate`}
+                  data-testid={``}
                 >
                   {formatDate(startingDate)}
killedBy: CommonsTablev2 component Commons card fields and action links are present and correct for index 0
statusReason: Unable to find an element by: [data-testid="CommonsTable-card-0-field-commons.startingDate"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:270:30
               <Button
                 variant="primary"
                 size="sm"
-                data-testid={`CommonsTable-card-${index}-action-Edit`}
+                data-testid={``}
                 onClick={() => handleEdit(id)}
               >
killedBy: CommonsTablev2 component Exercise hidden and visible actions for all commons rows to trigger mutated handlers
statusReason: Unable to find an element by: [data-testid="CommonsTable-card-0-action-Edit"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:271:26
                 variant="primary"
                 size="sm"
                 data-testid={`CommonsTable-card-${index}-action-Edit`}
-                onClick={() => handleEdit(id)}
+                onClick={() => undefined}
               >
                 Edit
killedBy: CommonsTablev2 component Visible Edit action navigates to edit page when adminUser (card button)
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:278:30
               <Button
                 variant="danger"
                 size="sm"
-                data-testid={`CommonsTable-card-${index}-action-Delete`}
+                data-testid={``}
                 onClick={() => handleDelete(commonsPlus)}
               >
killedBy: CommonsTablev2 component Legacy actions and hidden containers exist and behave (delete/modal, announcements, stats)
statusReason: Unable to find an element by: [data-testid="CommonsTable-card-0-action-Delete"]

Ignored nodes: comments, script, style
<body
  class="modal-open"
  data-rr-ui-modal-open=""
  style="padding-right: 2048px;"
>

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:279:26
                 variant="danger"
                 size="sm"
                 data-testid={`CommonsTable-card-${index}-action-Delete`}
-                onClick={() => handleDelete(commonsPlus)}
+                onClick={() => undefined}
               >
                 Delete
killedBy: CommonsTablev2 component Exercise hidden and visible actions for all commons rows to trigger mutated handlers
statusReason: Unable to find an element by: [data-testid="CommonsTable-Modal-Delete"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:286:30
               <Button
                 variant="secondary"
                 size="sm"
-                data-testid={`CommonsTable-card-${index}-action-Leaderboard`}
+                data-testid={``}
                 onClick={() => handleLeaderboard(id)}
               >
killedBy: CommonsTablev2 component Exercise hidden and visible actions for all commons rows to trigger mutated handlers
statusReason: Unable to find an element by: [data-testid="CommonsTable-card-0-action-Leaderboard"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:287:26
                 variant="secondary"
                 size="sm"
                 data-testid={`CommonsTable-card-${index}-action-Leaderboard`}
-                onClick={() => handleLeaderboard(id)}
+                onClick={() => undefined}
               >
                 Leaderboard
killedBy: CommonsTablev2 component Visible Leaderboard action navigates to leaderboard page when adminUser (card button)
statusReason: expected "spy" to be called with arguments: [ '/leaderboard/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:303:23
                 variant="info"
                 size="sm"
                 data-testid={`CommonsTable-card-${index}-action-Announcements`}
-                href={`/admin/announcements/${id}`}
+                href={``}
               >
                 Announcements
killedBy: CommonsTablev2 component Commons card fields and action links are present and correct for index 0
statusReason: expected '' to contain '/admin/announcements/'

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:313:35
                   visually hidden but placed inside the viewport so Playwright
                   can interact with these elements during integration tests. */}
               <div
-                style={{ display: "inline-block", opacity: 0 }}
+                style={{ display: "", opacity: 0 }}
                 aria-hidden="true"
               >
killedBy: CommonsTablev2 component Legacy actions and hidden containers exist and behave (delete/modal, announcements, stats)
statusReason: expected 'block' to be 'inline-block' // Object.is equality

[Killed] ObjectLiteral
main/components/Commons/CommonsTablev2.jsx:313:24
                   visually hidden but placed inside the viewport so Playwright
                   can interact with these elements during integration tests. */}
               <div
-                style={{ display: "inline-block", opacity: 0 }}
+                style={{}}
                 aria-hidden="true"
               >
killedBy: CommonsTablev2 component Legacy actions and hidden containers exist and behave (delete/modal, announcements, stats)
statusReason: expected 'block' to be 'inline-block' // Object.is equality

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:319:28
                 <button
                   className="btn btn-danger"
                   data-testid={`CommonsTable-cell-row-${index}-col-Delete`}
-                  onClick={() => handleDelete(commonsPlus)}
+                  onClick={() => undefined}
                 >
                   Delete
killedBy: CommonsTablev2 component Legacy actions and hidden containers exist and behave (delete/modal, announcements, stats)
statusReason: Unable to find an element with the text: /Permanently Delete/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:326:28
                 <button
                   className="btn btn-danger"
                   data-testid={`CommonsTable-cell-row-${index}-col-Delete-button`}
-                  onClick={() => handleDelete(commonsPlus)}
+                  onClick={() => undefined}
                 >
                   Delete
killedBy: AdminListCommonPage tests what happens when you click delete, admin
statusReason: Unable to find an element by: [data-testid="CommonsTable-Modal-Delete"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:333:28
                 <button
                   className="btn btn-primary"
                   data-testid={`CommonsTable-cell-row-${index}-col-Edit`}
-                  onClick={() => handleEdit(id)}
+                  onClick={() => undefined}
                 >
                   Edit
killedBy: CommonsTablev2 component Legacy Edit (alternate testid) navigates to edit page when adminUser
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:339:32
                 </button>
                 <button
                   className="btn btn-primary"
-                  data-testid={`CommonsTable-cell-row-${index}-col-Edit-button`}
+                  data-testid={``}
                   onClick={() => handleEdit(id)}
                 >
killedBy: CommonsTablev2 component Edit action navigates to edit page when adminUser (legacy hidden button)
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:340:28
                 <button
                   className="btn btn-primary"
                   data-testid={`CommonsTable-cell-row-${index}-col-Edit-button`}
-                  onClick={() => handleEdit(id)}
+                  onClick={() => undefined}
                 >
                   Edit
killedBy: CommonsTablev2 component Edit action navigates to edit page when adminUser (legacy hidden button)
statusReason: expected "spy" to be called with arguments: [ '/admin/editcommons/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:346:32
                 </button>
                 <button
                   className="btn btn-secondary"
-                  data-testid={`CommonsTable-cell-row-${index}-col-Leaderboard`}
+                  data-testid={``}
                   onClick={() => handleLeaderboard(id)}
                 >
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-0-col-Leaderboard"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:347:28
                 <button
                   className="btn btn-secondary"
                   data-testid={`CommonsTable-cell-row-${index}-col-Leaderboard`}
-                  onClick={() => handleLeaderboard(id)}
+                  onClick={() => undefined}
                 >
                   Leaderboard
killedBy: CommonsTablev2 component Legacy Leaderboard (alternate testid) navigates to leaderboard page when adminUser
statusReason: expected "spy" to be called with arguments: [ '/leaderboard/1' ]

Number of calls: 0

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:354:28
                 <button
                   className="btn btn-secondary"
                   data-testid={`CommonsTable-cell-row-${index}-col-Leaderboard-button`}
-                  onClick={() => handleLeaderboard(id)}
+                  onClick={() => undefined}
                 >
                   Leaderboard
killedBy: CommonsTablev2 component Leaderboard action navigates to leaderboard page when clicked (legacy hidden button)
statusReason: expected "spy" to be called with arguments: [ '/leaderboard/1' ]

Number of calls: 0

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:414:28
               {formatPlain(milkPrice)}
             </span>
             <span
-              data-testid={`CommonsTable-cell-row-${index}-col-commons.degradationRate`}
+              data-testid={``}
             >
               {formatPlain(degradationRate)}
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-1-col-commons.degradationRate"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:419:28
               {formatPlain(degradationRate)}
             </span>
             <span
-              data-testid={`CommonsTable-cell-row-${index}-col-commons.capacityPerUser`}
+              data-testid={``}
             >
               {formatPlain(capacityPerUser)}
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-1-col-commons.capacityPerUser"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:444:28
               {formatDate(lastDate)}
             </span>
             <span
-              data-testid={`CommonsTable-cell-row-${index}-col-commons.showLeaderboard`}
+              data-testid={``}
             >
               {formatBoolean(showLeaderboard)}
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-1-col-commons.showLeaderboard"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:453:32
             >
               {formatBoolean(showChat)}
             </span>
-            <span data-testid={`CommonsTable-cell-row-${index}-col-totalCows`}>
+            <span data-testid={``}>
               {formatPlain(totalCows)}
             </span>
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-1-col-totalCows"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:457:28
               {formatPlain(totalCows)}
             </span>
             <span
-              data-testid={`CommonsTable-cell-row-${index}-col-effectiveCapacity`}
+              data-testid={``}
             >
               {formatPlain(computedEffectiveCapacity)}
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-cell-row-1-col-effectiveCapacity"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="flex-column flex-md-row gap-3 align-items-start align-items-md-end mb-3 hstack"
    >

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:475:39
         data-testid="CommonsTable-Modal"
         style={{ display: showModal ? undefined : "none" }}
       />
-      <Modal show={showModal} onHide={() => setShowModal(false)}>
+      <Modal show={showModal} onHide={() => undefined}>
         <Modal.Header closeButton>
           <Modal.Title>Confirm Deletion</Modal.Title>
killedBy: CommonsTablev2 component Pressing the close button on the modal cancels the deletion
statusReason: expect(element).not.toBeVisible()

Received element is visible:
  <div
  data-testid="CommonsTable-Modal"
  style=""
/>

[Killed] BooleanLiteral
main/components/Commons/CommonsTablev2.jsx:475:58
         data-testid="CommonsTable-Modal"
         style={{ display: showModal ? undefined : "none" }}
       />
-      <Modal show={showModal} onHide={() => setShowModal(false)}>
+      <Modal show={showModal} onHide={() => setShowModal(true)}>
         <Modal.Header closeButton>
           <Modal.Title>Confirm Deletion</Modal.Title>
killedBy: CommonsTablev2 component Pressing the close button on the modal cancels the deletion
statusReason: expect(element).not.toBeVisible()

Received element is visible:
  <div
  data-testid="CommonsTable-Modal"
  style=""
/>

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:491:22
           <Button
             variant="danger"
             data-testid="CommonsTable-Modal-Delete"
-            onClick={() => confirmDelete()}
+            onClick={() => undefined}
           >
             Permanently Delete
killedBy: CommonsTablev2 component Clicking Permanently Delete button deletes the commons
statusReason: expect(element).not.toBeVisible()

Received element is visible:
  <div
  data-testid="CommonsTable-Modal"
  style=""
/>

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:508:16
       data-testid="CommonsTable-Modal-Delete-no-commons"
       style={{ display: "none" }}
       aria-hidden="true"
-      onClick={() => confirmDelete()}
+      onClick={() => undefined}
     />
   );
killedBy: CommonsTablev2 component hidden confirm-delete helper calls mutate when commonsToDelete set (kills arrow function mutant)
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
main/components/Commons/CommonsTablev2.jsx:514:8
 
   return (
     <>
-      {commons.length === 0 ? (
+      {false ? (
         <Alert
           variant="light"
killedBy: CommonsTablev2 component renders empty alert when commons list is empty
statusReason: Unable to find an element by: [data-testid="CommonsTable-empty"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>
