[Killed] EqualityOperator
main/components/Commons/CommonsTablev2.jsx:514:8
 
   return (
     <>
-      {commons.length === 0 ? (
+      {commons.length !== 0 ? (
         <Alert
           variant="light"
killedBy: CommonsTablev2 component Displays expected commons information and actions for adminUser
statusReason: Unable to find an element by: [data-testid="CommonsTable-card-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="fade border border-dashed alert alert-light show"
      data-testid="CommonsTable-empty"

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:533:27
               <Form.Select
                 size="sm"
                 value={validSortKey}
-                onChange={(event) => setSortKey(event.target.value)}
+                onChange={() => undefined}
                 data-testid="CommonsTable-sort-select"
                 data-current-sort={sortKey}
killedBy: CommonsTablev2 component component numeric sorting by milkPrice ascending and descending
statusReason: expected [ 'Alpha', 'Bravo', 'Charlie' ] to deeply equal [ 'Alpha', 'Charlie', 'Bravo' ]

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:537:34
                 data-testid="CommonsTable-sort-select"
                 data-current-sort={sortKey}
               >
-                {SORT_FIELDS.map((field) => (
-                  <option key={field.key} value={field.key}>
-                    {field.label}
-                  </option>
-                ))}
+                {SORT_FIELDS.map(() => undefined)}
               </Form.Select>
             </Form.Group>
killedBy: CommonsTablev2 component component numeric sorting by milkPrice ascending and descending
statusReason: Value "commons.milkPrice" not found in options

Ignored nodes: comments, script, style
<select
  class="form-select form-select-sm"
  data-current-sort="commons.id"
  data-testid="CommonsTable-sort-select"
  id="CommonsTable-sort-select-group"

[Killed] ArrowFunction
main/components/Commons/CommonsTablev2.jsx:549:24
               size="sm"
               data-testid="CommonsTable-sort-direction-toggle"
               data-current-direction={sortDirection}
-              onClick={() =>
-                setSortDirection(sortDirection === "asc" ? "desc" : "asc")
+              onClick={() => undefined
               }
             >
killedBy: CommonsTablev2 component allows sorting by Name descending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Descending
Received:
  Ascending

[Killed] EqualityOperator
main/components/Commons/CommonsTablev2.jsx:550:34
               data-testid="CommonsTable-sort-direction-toggle"
               data-current-direction={sortDirection}
               onClick={() =>
-                setSortDirection(sortDirection === "asc" ? "desc" : "asc")
+                setSortDirection(sortDirection !== "asc" ? "desc" : "asc")
               }
             >
killedBy: CommonsTablev2 component allows sorting by Name descending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Descending
Received:
  Ascending

[Killed] ConditionalExpression
main/components/Commons/CommonsTablev2.jsx:550:34
               data-testid="CommonsTable-sort-direction-toggle"
               data-current-direction={sortDirection}
               onClick={() =>
-                setSortDirection(sortDirection === "asc" ? "desc" : "asc")
+                setSortDirection(false ? "desc" : "asc")
               }
             >
killedBy: CommonsTablev2 component allows sorting by Name descending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Descending
Received:
  Ascending

[Killed] EqualityOperator
main/components/Commons/CommonsTablev2.jsx:553:16
                 setSortDirection(sortDirection === "asc" ? "desc" : "asc")
               }
             >
-              {sortDirection === "asc" ? "Ascending" : "Descending"}
+              {sortDirection !== "asc" ? "Ascending" : "Descending"}
             </Button>
           </Stack>
killedBy: CommonsTablev2 component allows sorting by Name descending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  Descending
Received:
  Ascending

[Killed] ConditionalExpression
main/components/Commons/CommonsTablev2.jsx:553:16
                 setSortDirection(sortDirection === "asc" ? "desc" : "asc")
               }
             >
-              {sortDirection === "asc" ? "Ascending" : "Descending"}
+              {false ? "Ascending" : "Descending"}
             </Button>
           </Stack>
killedBy: CommonsTablev2 component default sort select value is commons.id and toggle text changes
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  /Ascending/
Received:
  Descending

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:569:10
 
 const SORT_FIELDS = [
   { key: "commons.id", label: "id" },
-  { key: "commons.name", label: "Name" },
+  { key: "", label: "Name" },
   { key: "commons.cowPrice", label: "Cow Price" },
   { key: "commons.milkPrice", label: "Milk Price" },
killedBy: CommonsTablev2 component allows sorting by Name descending
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  3
Received:
  1

[Timeout] StringLiteral
main/components/Commons/CommonsTablev2.jsx:570:37
 const SORT_FIELDS = [
   { key: "commons.id", label: "id" },
   { key: "commons.name", label: "Name" },
-  { key: "commons.cowPrice", label: "Cow Price" },
+  { key: "commons.cowPrice", label: "" },
   { key: "commons.milkPrice", label: "Milk Price" },
   { key: "commons.startingBalance", label: "Start Bal" },

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:573:10
   { key: "commons.cowPrice", label: "Cow Price" },
   { key: "commons.milkPrice", label: "Milk Price" },
   { key: "commons.startingBalance", label: "Start Bal" },
-  { key: "commons.startingDate", label: "Starting Date" },
+  { key: "", label: "Starting Date" },
   { key: "commons.lastDate", label: "Last Date" },
   { key: "commons.degradationRate", label: "Degrad Rate" },
killedBy: CommonsTablev2 component invalid sort key falls back to default commons.id
statusReason: expect(element).toHaveValue(commons.id)

Expected the element to have value:
  commons.id
Received:

[Timeout] StringLiteral
main/components/Commons/CommonsTablev2.jsx:574:37
   { key: "commons.milkPrice", label: "Milk Price" },
   { key: "commons.startingBalance", label: "Start Bal" },
   { key: "commons.startingDate", label: "Starting Date" },
-  { key: "commons.lastDate", label: "Last Date" },
+  { key: "commons.lastDate", label: "" },
   { key: "commons.degradationRate", label: "Degrad Rate" },
   { key: "commons.showLeaderboard", label: "Show LrdrBrd?" },

[Killed] ObjectLiteral
main/components/Commons/CommonsTablev2.jsx:576:3
   { key: "commons.startingDate", label: "Starting Date" },
   { key: "commons.lastDate", label: "Last Date" },
   { key: "commons.degradationRate", label: "Degrad Rate" },
-  { key: "commons.showLeaderboard", label: "Show LrdrBrd?" },
+  {},
   { key: "commons.showChat", label: "Show Chat?" },
   { key: "totalCows", label: "Tot Cows" },
killedBy: CommonsTablev2 component sorting handles mixed non-string values via toString fallback
statusReason: Value "commons.showLeaderboard" not found in options

Ignored nodes: comments, script, style
<select
  class="form-select form-select-sm"
  data-current-sort="commons.id"
  data-testid="CommonsTable-sort-select"
  id="CommonsTable-sort-select-group"

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:576:10
   { key: "commons.startingDate", label: "Starting Date" },
   { key: "commons.lastDate", label: "Last Date" },
   { key: "commons.degradationRate", label: "Degrad Rate" },
-  { key: "commons.showLeaderboard", label: "Show LrdrBrd?" },
+  { key: "", label: "Show LrdrBrd?" },
   { key: "commons.showChat", label: "Show Chat?" },
   { key: "totalCows", label: "Tot Cows" },
killedBy: CommonsTablev2 component invalid sort key falls back to default commons.id
statusReason: expect(element).toHaveValue(commons.id)

Expected the element to have value:
  commons.id
Received:

[Timeout] ObjectLiteral
main/components/Commons/CommonsTablev2.jsx:577:3
   { key: "commons.lastDate", label: "Last Date" },
   { key: "commons.degradationRate", label: "Degrad Rate" },
   { key: "commons.showLeaderboard", label: "Show LrdrBrd?" },
-  { key: "commons.showChat", label: "Show Chat?" },
+  {},
   { key: "totalCows", label: "Tot Cows" },
   { key: "commons.capacityPerUser", label: "Cap / User" },

[Killed] StringLiteral
main/components/Commons/CommonsTablev2.jsx:578:10
   { key: "commons.degradationRate", label: "Degrad Rate" },
   { key: "commons.showLeaderboard", label: "Show LrdrBrd?" },
   { key: "commons.showChat", label: "Show Chat?" },
-  { key: "totalCows", label: "Tot Cows" },
+  { key: "", label: "Tot Cows" },
   { key: "commons.capacityPerUser", label: "Cap / User" },
   { key: "commons.carryingCapacity", label: "Carry Cap" },
killedBy: CommonsTablev2 component invalid sort key falls back to default commons.id
statusReason: expect(element).toHaveValue(commons.id)

Expected the element to have value:
  commons.id
Received:

[Timeout] ObjectLiteral
main/components/Commons/CommonsTablev2.jsx:579:3
   { key: "commons.showLeaderboard", label: "Show LrdrBrd?" },
   { key: "commons.showChat", label: "Show Chat?" },
   { key: "totalCows", label: "Tot Cows" },
-  { key: "commons.capacityPerUser", label: "Cap / User" },
+  {},
   { key: "commons.carryingCapacity", label: "Carry Cap" },
   { key: "effectiveCapacity", label: "Eff Cap" },

[Timeout] ObjectLiteral
main/components/Commons/CommonsTablev2.jsx:580:3
   { key: "commons.showChat", label: "Show Chat?" },
   { key: "totalCows", label: "Tot Cows" },
   { key: "commons.capacityPerUser", label: "Cap / User" },
-  { key: "commons.carryingCapacity", label: "Carry Cap" },
+  {},
   { key: "effectiveCapacity", label: "Eff Cap" },
 ];

[Timeout] StringLiteral
main/components/Commons/CommonsTablev2.jsx:580:45
   { key: "commons.showChat", label: "Show Chat?" },
   { key: "totalCows", label: "Tot Cows" },
   { key: "commons.capacityPerUser", label: "Cap / User" },
-  { key: "commons.carryingCapacity", label: "Carry Cap" },
+  { key: "commons.carryingCapacity", label: "" },
   { key: "effectiveCapacity", label: "Eff Cap" },
 ];
