[Killed] BlockStatement
main/components/Commons/commonsCardUtils.js:3:34
 const ISO_DATE_LENGTH = 10;
 
-function toDateKey(dateOrString) {
-  if (!dateOrString) return "";
-  if (typeof dateOrString === "string") {
-    return dateOrString.substring(0, ISO_DATE_LENGTH);
-  }
-  const year = dateOrString.getFullYear();
-  const month = String(dateOrString.getMonth() + 1).padStart(2, "0");
-  const day = String(dateOrString.getDate()).padStart(2, "0");
-  return `${year}-${month}-${day}`;
-}
+function toDateKey(dateOrString) {}
 
 export function isFutureDate(startingDate, currentDate = new Date()) {
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
main/components/Commons/commonsCardUtils.js:4:7
 const ISO_DATE_LENGTH = 10;
 
 function toDateKey(dateOrString) {
-  if (!dateOrString) return "";
+  if (dateOrString) return "";
   if (typeof dateOrString === "string") {
     return dateOrString.substring(0, ISO_DATE_LENGTH);
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsCardUtils.js:4:7
 const ISO_DATE_LENGTH = 10;
 
 function toDateKey(dateOrString) {
-  if (!dateOrString) return "";
+  if (true) return "";
   if (typeof dateOrString === "string") {
     return dateOrString.substring(0, ISO_DATE_LENGTH);
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsCardUtils.js:5:7
 
 function toDateKey(dateOrString) {
   if (!dateOrString) return "";
-  if (typeof dateOrString === "string") {
+  if (true) {
     return dateOrString.substring(0, ISO_DATE_LENGTH);
   }
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: dateOrString.substring is not a function

[Killed] BlockStatement
main/components/Commons/commonsCardUtils.js:5:41
 
 function toDateKey(dateOrString) {
   if (!dateOrString) return "";
-  if (typeof dateOrString === "string") {
-    return dateOrString.substring(0, ISO_DATE_LENGTH);
-  }
+  if (typeof dateOrString === "string") {}
   const year = dateOrString.getFullYear();
   const month = String(dateOrString.getMonth() + 1).padStart(2, "0");
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: dateOrString.getFullYear is not a function

[Killed] MethodExpression
main/components/Commons/commonsCardUtils.js:6:12
 function toDateKey(dateOrString) {
   if (!dateOrString) return "";
   if (typeof dateOrString === "string") {
-    return dateOrString.substring(0, ISO_DATE_LENGTH);
+    return dateOrString;
   }
   const year = dateOrString.getFullYear();
killedBy: CommonsCardv2 tests isFutureDate treats ISO strings with time component as the same calendar day
statusReason: expected true to be false // Object.is equality

[Killed] ArithmeticOperator
main/components/Commons/commonsCardUtils.js:9:24
     return dateOrString.substring(0, ISO_DATE_LENGTH);
   }
   const year = dateOrString.getFullYear();
-  const month = String(dateOrString.getMonth() + 1).padStart(2, "0");
+  const month = String(dateOrString.getMonth() - 1).padStart(2, "0");
   const day = String(dateOrString.getDate()).padStart(2, "0");
   return `${year}-${month}-${day}`;
killedBy: CommonsCardv2 tests isFutureDate returns false when target date equals reference
statusReason: expected true to be false // Object.is equality

[Killed] StringLiteral
main/components/Commons/commonsCardUtils.js:11:10
   const year = dateOrString.getFullYear();
   const month = String(dateOrString.getMonth() + 1).padStart(2, "0");
   const day = String(dateOrString.getDate()).padStart(2, "0");
-  return `${year}-${month}-${day}`;
+  return ``;
 }
 
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
main/components/Commons/commonsCardUtils.js:14:70
   return `${year}-${month}-${day}`;
 }
 
-export function isFutureDate(startingDate, currentDate = new Date()) {
-  const targetKey = toDateKey(startingDate);
-  const referenceKey = toDateKey(currentDate);
-  if (!targetKey || !referenceKey) return false;
-  return targetKey > referenceKey;
-}
+export function isFutureDate(startingDate, currentDate = new Date()) {}
 
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: expected undefined to be true // Object.is equality

[Killed] BooleanLiteral
main/components/Commons/commonsCardUtils.js:17:7
 export function isFutureDate(startingDate, currentDate = new Date()) {
   const targetKey = toDateKey(startingDate);
   const referenceKey = toDateKey(currentDate);
-  if (!targetKey || !referenceKey) return false;
+  if (targetKey || !referenceKey) return false;
   return targetKey > referenceKey;
 }
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsCardUtils.js:17:7
 export function isFutureDate(startingDate, currentDate = new Date()) {
   const targetKey = toDateKey(startingDate);
   const referenceKey = toDateKey(currentDate);
-  if (!targetKey || !referenceKey) return false;
+  if (true) return false;
   return targetKey > referenceKey;
 }
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
main/components/Commons/commonsCardUtils.js:18:10
   const targetKey = toDateKey(startingDate);
   const referenceKey = toDateKey(currentDate);
   if (!targetKey || !referenceKey) return false;
-  return targetKey > referenceKey;
+  return targetKey >= referenceKey;
 }
 
killedBy: CommonsCardv2 tests isFutureDate returns false when target date equals reference
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsCardUtils.js:18:10
   const targetKey = toDateKey(startingDate);
   const referenceKey = toDateKey(currentDate);
   if (!targetKey || !referenceKey) return false;
-  return targetKey > referenceKey;
+  return false;
 }
 
killedBy: CommonsCardv2 tests isFutureDate returns true when target date is after reference
statusReason: expected false to be true // Object.is equality
