[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:3:36
 // Utility helpers for CommonsTable (extracted to satisfy react-refresh rule)
 
-export function formatPlain(value) {
-  if (value === null || value === undefined || value === "") {
-    return "—";
-  }
-  return `${value}`;
-}
+export function formatPlain(value) {}
 
 export function formatDate(value) {
killedBy: commonsTableUtils helpers formatPlain returns dash for null/empty/undefined
statusReason: expected undefined to be '—' // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:4:48
 // Utility helpers for CommonsTable (extracted to satisfy react-refresh rule)
 
 export function formatPlain(value) {
-  if (value === null || value === undefined || value === "") {
+  if (value === null || value === undefined || false) {
     return "—";
   }
killedBy: commonsTableUtils helpers formatPlain returns dash for null/empty/undefined
statusReason: expected '' to be '—' // Object.is equality

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:4:25
 // Utility helpers for CommonsTable (extracted to satisfy react-refresh rule)
 
 export function formatPlain(value) {
-  if (value === null || value === undefined || value === "") {
+  if (value === null || value !== undefined || value === "") {
     return "—";
   }
killedBy: commonsTableUtils helpers formatPlain returns dash for null/empty/undefined
statusReason: expected 'undefined' to be '—' // Object.is equality

[Killed] StringLiteral
main/components/Commons/commonsTableUtils.js:7:10
   if (value === null || value === undefined || value === "") {
     return "—";
   }
-  return `${value}`;
+  return ``;
 }
 
killedBy: commonsTableUtils helpers formatPlain returns string for non-empty values
statusReason: expected '' to be '123' // Object.is equality

[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:10:35
   return `${value}`;
 }
 
-export function formatDate(value) {
-  if (!value) return "—";
-  return String(value).slice(0, 10);
-}
+export function formatDate(value) {}
 
 export function formatBoolean(value) {
killedBy: commonsTableUtils additional coverage formatDate handles empty inputs and trims ISO strings
statusReason: expected undefined to be '—' // Object.is equality

[Killed] BooleanLiteral
main/components/Commons/commonsTableUtils.js:11:7
 }
 
 export function formatDate(value) {
-  if (!value) return "—";
+  if (value) return "—";
   return String(value).slice(0, 10);
 }
killedBy: commonsTableUtils additional coverage formatDate handles empty inputs and trims ISO strings
statusReason: expected 'null' to be '—' // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:11:7
 }
 
 export function formatDate(value) {
-  if (!value) return "—";
+  if (false) return "—";
   return String(value).slice(0, 10);
 }
killedBy: commonsTableUtils additional coverage formatDate handles empty inputs and trims ISO strings
statusReason: expected 'null' to be '—' // Object.is equality

[Killed] MethodExpression
main/components/Commons/commonsTableUtils.js:12:10
 
 export function formatDate(value) {
   if (!value) return "—";
-  return String(value).slice(0, 10);
+  return String(value);
 }
 
killedBy: commonsTableUtils additional coverage formatDate handles empty inputs and trims ISO strings
statusReason: expected '2022-12-12T05:06:07Z' to be '2022-12-12' // Object.is equality

[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:15:38
   return String(value).slice(0, 10);
 }
 
-export function formatBoolean(value) {
-  if (value === null || value === undefined || value === "") {
-    return "—";
-  }
-  return String(value);
-}
+export function formatBoolean(value) {}
 
 export function computeEffectiveCapacity(commonsPlus) {
killedBy: commonsTableUtils additional coverage formatBoolean mirrors formatPlain semantics for nullish inputs
statusReason: expected undefined to be '—' // Object.is equality

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:16:48
 }
 
 export function formatBoolean(value) {
-  if (value === null || value === undefined || value === "") {
+  if (value === null || value === undefined || value !== "") {
     return "—";
   }
killedBy: commonsTableUtils additional coverage formatBoolean mirrors formatPlain semantics for nullish inputs
statusReason: expected '' to be '—' // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:16:7
 }
 
 export function formatBoolean(value) {
-  if (value === null || value === undefined || value === "") {
+  if (true) {
     return "—";
   }
killedBy: commonsTableUtils additional coverage formatBoolean mirrors formatPlain semantics for nullish inputs
statusReason: expected '—' to be 'true' // Object.is equality

[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:22:55
   return String(value);
 }
 
-export function computeEffectiveCapacity(commonsPlus) {
-  const { effectiveCapacity, commons: commonsData, totalUsers } = commonsPlus;
-  if (effectiveCapacity !== null && effectiveCapacity !== undefined) {
-    return effectiveCapacity;
-  }
-  if (
-    commonsData &&
-    commonsData.capacityPerUser !== null &&
-    commonsData.capacityPerUser !== undefined &&
-    totalUsers !== null &&
-    totalUsers !== undefined
-  ) {
-    return commonsData.capacityPerUser * totalUsers;
-  }
-  return null;
-}
+export function computeEffectiveCapacity(commonsPlus) {}
 
 const NUMERIC_SORT_KEYS = new Set([
killedBy: commonsTableUtils helpers getSortableValue effectiveCapacity uses explicit value when finite
statusReason: expected null to be 42 // Object.is equality

[Killed] LogicalOperator
main/components/Commons/commonsTableUtils.js:24:7
 
 export function computeEffectiveCapacity(commonsPlus) {
   const { effectiveCapacity, commons: commonsData, totalUsers } = commonsPlus;
-  if (effectiveCapacity !== null && effectiveCapacity !== undefined) {
+  if (effectiveCapacity !== null || effectiveCapacity !== undefined) {
     return effectiveCapacity;
   }
killedBy: commonsTableUtils helpers getSortableValue effectiveCapacity falls back to computed value
statusReason: expected null to be 12 // Object.is equality

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:24:7
 
 export function computeEffectiveCapacity(commonsPlus) {
   const { effectiveCapacity, commons: commonsData, totalUsers } = commonsPlus;
-  if (effectiveCapacity !== null && effectiveCapacity !== undefined) {
+  if (effectiveCapacity === null && effectiveCapacity !== undefined) {
     return effectiveCapacity;
   }
killedBy: commonsTableUtils helpers getSortableValue effectiveCapacity uses explicit value when finite
statusReason: expected 20 to be 42 // Object.is equality

[Killed] LogicalOperator
main/components/Commons/commonsTableUtils.js:28:5
     return effectiveCapacity;
   }
   if (
-    commonsData &&
-    commonsData.capacityPerUser !== null &&
-    commonsData.capacityPerUser !== undefined &&
-    totalUsers !== null &&
+    commonsData && commonsData.capacityPerUser !== null && commonsData.capacityPerUser !== undefined || totalUsers !== null &&
     totalUsers !== undefined
   ) {
killedBy: commonsTableUtils additional coverage computeEffectiveCapacity covers explicit, computed, and null branches
statusReason: expected +0 to be null

[Killed] LogicalOperator
main/components/Commons/commonsTableUtils.js:28:5
     return effectiveCapacity;
   }
   if (
-    commonsData &&
-    commonsData.capacityPerUser !== null &&
-    commonsData.capacityPerUser !== undefined &&
+    commonsData && commonsData.capacityPerUser !== null || commonsData.capacityPerUser !== undefined &&
     totalUsers !== null &&
     totalUsers !== undefined
killedBy: commonsTableUtils additional coverage computeEffectiveCapacity covers explicit, computed, and null branches
statusReason: expected +0 to be null

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:29:5
   }
   if (
     commonsData &&
-    commonsData.capacityPerUser !== null &&
+    true &&
     commonsData.capacityPerUser !== undefined &&
     totalUsers !== null &&
killedBy: commonsTableUtils additional coverage computeEffectiveCapacity covers explicit, computed, and null branches
statusReason: expected +0 to be null

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:29:5
   }
   if (
     commonsData &&
-    commonsData.capacityPerUser !== null &&
+    commonsData.capacityPerUser === null &&
     commonsData.capacityPerUser !== undefined &&
     totalUsers !== null &&
killedBy: commonsTableUtils helpers getSortableValue effectiveCapacity falls back to computed value
statusReason: expected null to be 12 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:30:5
   if (
     commonsData &&
     commonsData.capacityPerUser !== null &&
-    commonsData.capacityPerUser !== undefined &&
+    true &&
     totalUsers !== null &&
     totalUsers !== undefined
killedBy: CommonsTablev2 component computeEffectiveCapacity returns null when capacityPerUser missing
statusReason: expected NaN to be null

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:30:5
   if (
     commonsData &&
     commonsData.capacityPerUser !== null &&
-    commonsData.capacityPerUser !== undefined &&
+    commonsData.capacityPerUser === undefined &&
     totalUsers !== null &&
     totalUsers !== undefined
killedBy: commonsTableUtils helpers getSortableValue effectiveCapacity falls back to computed value
statusReason: expected null to be 12 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:31:5
     commonsData &&
     commonsData.capacityPerUser !== null &&
     commonsData.capacityPerUser !== undefined &&
-    totalUsers !== null &&
+    true &&
     totalUsers !== undefined
   ) {
killedBy: commonsTableUtils additional coverage computeEffectiveCapacity covers explicit, computed, and null branches
statusReason: expected +0 to be null

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:31:5
     commonsData &&
     commonsData.capacityPerUser !== null &&
     commonsData.capacityPerUser !== undefined &&
-    totalUsers !== null &&
+    totalUsers === null &&
     totalUsers !== undefined
   ) {
killedBy: commonsTableUtils helpers getSortableValue effectiveCapacity falls back to computed value
statusReason: expected null to be 12 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:32:5
     commonsData.capacityPerUser !== null &&
     commonsData.capacityPerUser !== undefined &&
     totalUsers !== null &&
-    totalUsers !== undefined
+    true
   ) {
     return commonsData.capacityPerUser * totalUsers;
killedBy: commonsTableUtils additional coverage computeEffectiveCapacity returns null when capacityPerUser present but totalUsers undefined
statusReason: expected NaN to be null

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:32:5
     commonsData.capacityPerUser !== null &&
     commonsData.capacityPerUser !== undefined &&
     totalUsers !== null &&
-    totalUsers !== undefined
+    totalUsers === undefined
   ) {
     return commonsData.capacityPerUser * totalUsers;
killedBy: commonsTableUtils helpers getSortableValue effectiveCapacity falls back to computed value
statusReason: expected null to be 12 // Object.is equality

[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:33:5
     commonsData.capacityPerUser !== undefined &&
     totalUsers !== null &&
     totalUsers !== undefined
-  ) {
-    return commonsData.capacityPerUser * totalUsers;
-  }
+  ) {}
   return null;
 }
killedBy: commonsTableUtils helpers getSortableValue effectiveCapacity falls back to computed value
statusReason: expected null to be 12 // Object.is equality

[Killed] ArithmeticOperator
main/components/Commons/commonsTableUtils.js:34:12
     totalUsers !== null &&
     totalUsers !== undefined
   ) {
-    return commonsData.capacityPerUser * totalUsers;
+    return commonsData.capacityPerUser / totalUsers;
   }
   return null;
killedBy: commonsTableUtils helpers getSortableValue effectiveCapacity falls back to computed value
statusReason: expected 0.75 to be 12 // Object.is equality

[Killed] ArrayDeclaration
main/components/Commons/commonsTableUtils.js:39:35
   return null;
 }
 
-const NUMERIC_SORT_KEYS = new Set([
-  "commons.cowPrice",
-  "commons.milkPrice",
-  "commons.startingBalance",
-  "commons.degradationRate",
-  "totalCows",
-  "commons.capacityPerUser",
-  "commons.carryingCapacity",
-  "effectiveCapacity",
-]);
+const NUMERIC_SORT_KEYS = new Set([]);
 
 const STRING_DEFAULT_EMPTY_KEYS = new Set([
killedBy: commonsTableUtils helpers getSortableValue parses numeric fields and handles invalid values
statusReason: expected '5.5' to be 5.5 // Object.is equality

[Killed] StringLiteral
main/components/Commons/commonsTableUtils.js:42:3
 const NUMERIC_SORT_KEYS = new Set([
   "commons.cowPrice",
   "commons.milkPrice",
-  "commons.startingBalance",
+  "",
   "commons.degradationRate",
   "totalCows",
killedBy: commonsTableUtils helpers getSortableValue parses numeric fields and handles invalid values
statusReason: expected '1000' to be 1000 // Object.is equality

[Killed] StringLiteral
main/components/Commons/commonsTableUtils.js:43:3
   "commons.cowPrice",
   "commons.milkPrice",
   "commons.startingBalance",
-  "commons.degradationRate",
+  "",
   "totalCows",
   "commons.capacityPerUser",
killedBy: commonsTableUtils helpers getSortableValue parses numeric fields and handles invalid values
statusReason: expected '0.123' to be 0.123 // Object.is equality

[Killed] StringLiteral
main/components/Commons/commonsTableUtils.js:46:3
   "commons.degradationRate",
   "totalCows",
   "commons.capacityPerUser",
-  "commons.carryingCapacity",
+  "",
   "effectiveCapacity",
 ]);
killedBy: commonsTableUtils additional coverage getSortableValue handles exhaustive numeric, boolean, and date branches
statusReason: expected '10' to be 10 // Object.is equality

[Killed] StringLiteral
main/components/Commons/commonsTableUtils.js:47:3
   "totalCows",
   "commons.capacityPerUser",
   "commons.carryingCapacity",
-  "effectiveCapacity",
+  "",
 ]);
 
killedBy: commonsTableUtils additional coverage getSortableValue normalizes effectiveCapacity edge cases
statusReason: expected '' to be null

[Killed] StringLiteral
main/components/Commons/commonsTableUtils.js:51:3
 ]);
 
 const STRING_DEFAULT_EMPTY_KEYS = new Set([
-  "commons.name",
+  "",
   "commons.startingDate",
   "commons.lastDate",
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: expected null to be '' // Object.is equality

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:57:17
 ]);
 
 const sortableValueResolvers = {
-  "commons.id": (commonsPlus) => commonsPlus.commons?.id,
+  "commons.id": () => undefined,
   "commons.name": (commonsPlus) => commonsPlus.commons?.name,
   "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
killedBy: commonsTableUtils helpers getSortableValue returns id and name
statusReason: expected null to be 7 // Object.is equality

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:57:34
 ]);
 
 const sortableValueResolvers = {
-  "commons.id": (commonsPlus) => commonsPlus.commons?.id,
+  "commons.id": (commonsPlus) => commonsPlus.commons.id,
   "commons.name": (commonsPlus) => commonsPlus.commons?.name,
   "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:58:19
 
 const sortableValueResolvers = {
   "commons.id": (commonsPlus) => commonsPlus.commons?.id,
-  "commons.name": (commonsPlus) => commonsPlus.commons?.name,
+  "commons.name": () => undefined,
   "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
   "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
killedBy: commonsTableUtils helpers getSortableValue returns id and name
statusReason: expected '' to be 'Seven' // Object.is equality

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:58:36
 
 const sortableValueResolvers = {
   "commons.id": (commonsPlus) => commonsPlus.commons?.id,
-  "commons.name": (commonsPlus) => commonsPlus.commons?.name,
+  "commons.name": (commonsPlus) => commonsPlus.commons.name,
   "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
   "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'name')

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:59:40
 const sortableValueResolvers = {
   "commons.id": (commonsPlus) => commonsPlus.commons?.id,
   "commons.name": (commonsPlus) => commonsPlus.commons?.name,
-  "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
+  "commons.cowPrice": (commonsPlus) => commonsPlus.commons.cowPrice,
   "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
   "commons.startingBalance": (commonsPlus) =>
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'cowPrice')

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:59:23
 const sortableValueResolvers = {
   "commons.id": (commonsPlus) => commonsPlus.commons?.id,
   "commons.name": (commonsPlus) => commonsPlus.commons?.name,
-  "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
+  "commons.cowPrice": () => undefined,
   "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
   "commons.startingBalance": (commonsPlus) =>
killedBy: commonsTableUtils helpers getSortableValue parses numeric fields and handles invalid values
statusReason: expected null to be 5.5 // Object.is equality

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:60:24
   "commons.id": (commonsPlus) => commonsPlus.commons?.id,
   "commons.name": (commonsPlus) => commonsPlus.commons?.name,
   "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
-  "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
+  "commons.milkPrice": () => undefined,
   "commons.startingBalance": (commonsPlus) =>
     commonsPlus.commons?.startingBalance,
killedBy: commonsTableUtils helpers getSortableValue parses numeric fields and handles invalid values
statusReason: expected null to be 2.5 // Object.is equality

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:60:41
   "commons.id": (commonsPlus) => commonsPlus.commons?.id,
   "commons.name": (commonsPlus) => commonsPlus.commons?.name,
   "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
-  "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
+  "commons.milkPrice": (commonsPlus) => commonsPlus.commons.milkPrice,
   "commons.startingBalance": (commonsPlus) =>
     commonsPlus.commons?.startingBalance,
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'milkPrice')

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:61:30
   "commons.name": (commonsPlus) => commonsPlus.commons?.name,
   "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
   "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
-  "commons.startingBalance": (commonsPlus) =>
-    commonsPlus.commons?.startingBalance,
+  "commons.startingBalance": () => undefined,
   "commons.startingDate": (commonsPlus) => commonsPlus.commons?.startingDate,
   "commons.lastDate": (commonsPlus) => commonsPlus.commons?.lastDate,
killedBy: commonsTableUtils helpers getSortableValue parses numeric fields and handles invalid values
statusReason: expected null to be 1000 // Object.is equality

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:62:5
   "commons.cowPrice": (commonsPlus) => commonsPlus.commons?.cowPrice,
   "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
   "commons.startingBalance": (commonsPlus) =>
-    commonsPlus.commons?.startingBalance,
+    commonsPlus.commons.startingBalance,
   "commons.startingDate": (commonsPlus) => commonsPlus.commons?.startingDate,
   "commons.lastDate": (commonsPlus) => commonsPlus.commons?.lastDate,
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'startingBalance')

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:63:27
   "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
   "commons.startingBalance": (commonsPlus) =>
     commonsPlus.commons?.startingBalance,
-  "commons.startingDate": (commonsPlus) => commonsPlus.commons?.startingDate,
+  "commons.startingDate": () => undefined,
   "commons.lastDate": (commonsPlus) => commonsPlus.commons?.lastDate,
   "commons.degradationRate": (commonsPlus) =>
killedBy: commonsTableUtils helpers getSortableValue handles date and boolean fields
statusReason: expected '' to be '2022-12-12' // Object.is equality

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:63:44
   "commons.milkPrice": (commonsPlus) => commonsPlus.commons?.milkPrice,
   "commons.startingBalance": (commonsPlus) =>
     commonsPlus.commons?.startingBalance,
-  "commons.startingDate": (commonsPlus) => commonsPlus.commons?.startingDate,
+  "commons.startingDate": (commonsPlus) => commonsPlus.commons.startingDate,
   "commons.lastDate": (commonsPlus) => commonsPlus.commons?.lastDate,
   "commons.degradationRate": (commonsPlus) =>
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'startingDate')

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:64:40
   "commons.startingBalance": (commonsPlus) =>
     commonsPlus.commons?.startingBalance,
   "commons.startingDate": (commonsPlus) => commonsPlus.commons?.startingDate,
-  "commons.lastDate": (commonsPlus) => commonsPlus.commons?.lastDate,
+  "commons.lastDate": (commonsPlus) => commonsPlus.commons.lastDate,
   "commons.degradationRate": (commonsPlus) =>
     commonsPlus.commons?.degradationRate,
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'lastDate')

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:64:23
   "commons.startingBalance": (commonsPlus) =>
     commonsPlus.commons?.startingBalance,
   "commons.startingDate": (commonsPlus) => commonsPlus.commons?.startingDate,
-  "commons.lastDate": (commonsPlus) => commonsPlus.commons?.lastDate,
+  "commons.lastDate": () => undefined,
   "commons.degradationRate": (commonsPlus) =>
     commonsPlus.commons?.degradationRate,
killedBy: commonsTableUtils helpers getSortableValue handles date and boolean fields
statusReason: expected '' to be '2023-01-02T03:04:05Z' // Object.is equality

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:65:30
     commonsPlus.commons?.startingBalance,
   "commons.startingDate": (commonsPlus) => commonsPlus.commons?.startingDate,
   "commons.lastDate": (commonsPlus) => commonsPlus.commons?.lastDate,
-  "commons.degradationRate": (commonsPlus) =>
-    commonsPlus.commons?.degradationRate,
+  "commons.degradationRate": () => undefined,
   "commons.showLeaderboard": (commonsPlus) =>
     commonsPlus.commons?.showLeaderboard,
killedBy: commonsTableUtils helpers getSortableValue parses numeric fields and handles invalid values
statusReason: expected null to be 0.123 // Object.is equality

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:66:5
   "commons.startingDate": (commonsPlus) => commonsPlus.commons?.startingDate,
   "commons.lastDate": (commonsPlus) => commonsPlus.commons?.lastDate,
   "commons.degradationRate": (commonsPlus) =>
-    commonsPlus.commons?.degradationRate,
+    commonsPlus.commons.degradationRate,
   "commons.showLeaderboard": (commonsPlus) =>
     commonsPlus.commons?.showLeaderboard,
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'degradationRate')

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:67:30
   "commons.lastDate": (commonsPlus) => commonsPlus.commons?.lastDate,
   "commons.degradationRate": (commonsPlus) =>
     commonsPlus.commons?.degradationRate,
-  "commons.showLeaderboard": (commonsPlus) =>
-    commonsPlus.commons?.showLeaderboard,
+  "commons.showLeaderboard": () => undefined,
   "commons.showChat": (commonsPlus) => commonsPlus.commons?.showChat,
   totalCows: (commonsPlus) => commonsPlus.totalCows,
killedBy: commonsTableUtils helpers getSortableValue handles date and boolean fields
statusReason: expected null to be true // Object.is equality

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:68:5
   "commons.degradationRate": (commonsPlus) =>
     commonsPlus.commons?.degradationRate,
   "commons.showLeaderboard": (commonsPlus) =>
-    commonsPlus.commons?.showLeaderboard,
+    commonsPlus.commons.showLeaderboard,
   "commons.showChat": (commonsPlus) => commonsPlus.commons?.showChat,
   totalCows: (commonsPlus) => commonsPlus.totalCows,
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'showLeaderboard')

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:69:23
     commonsPlus.commons?.degradationRate,
   "commons.showLeaderboard": (commonsPlus) =>
     commonsPlus.commons?.showLeaderboard,
-  "commons.showChat": (commonsPlus) => commonsPlus.commons?.showChat,
+  "commons.showChat": () => undefined,
   totalCows: (commonsPlus) => commonsPlus.totalCows,
   "commons.capacityPerUser": (commonsPlus) =>
killedBy: commonsTableUtils helpers getSortableValue handles date and boolean fields
statusReason: expected null to be false // Object.is equality

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:69:40
     commonsPlus.commons?.degradationRate,
   "commons.showLeaderboard": (commonsPlus) =>
     commonsPlus.commons?.showLeaderboard,
-  "commons.showChat": (commonsPlus) => commonsPlus.commons?.showChat,
+  "commons.showChat": (commonsPlus) => commonsPlus.commons.showChat,
   totalCows: (commonsPlus) => commonsPlus.totalCows,
   "commons.capacityPerUser": (commonsPlus) =>
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'showChat')

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:70:14
   "commons.showLeaderboard": (commonsPlus) =>
     commonsPlus.commons?.showLeaderboard,
   "commons.showChat": (commonsPlus) => commonsPlus.commons?.showChat,
-  totalCows: (commonsPlus) => commonsPlus.totalCows,
+  totalCows: () => undefined,
   "commons.capacityPerUser": (commonsPlus) =>
     commonsPlus.commons?.capacityPerUser,
killedBy: commonsTableUtils helpers getSortableValue parses numeric fields and handles invalid values
statusReason: expected null to be 3 // Object.is equality

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:71:30
     commonsPlus.commons?.showLeaderboard,
   "commons.showChat": (commonsPlus) => commonsPlus.commons?.showChat,
   totalCows: (commonsPlus) => commonsPlus.totalCows,
-  "commons.capacityPerUser": (commonsPlus) =>
-    commonsPlus.commons?.capacityPerUser,
+  "commons.capacityPerUser": () => undefined,
   "commons.carryingCapacity": (commonsPlus) =>
     commonsPlus.commons?.carryingCapacity,
killedBy: commonsTableUtils additional coverage getSortableValue handles exhaustive numeric, boolean, and date branches
statusReason: expected null to be 7 // Object.is equality

[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:72:5
   "commons.showChat": (commonsPlus) => commonsPlus.commons?.showChat,
   totalCows: (commonsPlus) => commonsPlus.totalCows,
   "commons.capacityPerUser": (commonsPlus) =>
-    commonsPlus.commons?.capacityPerUser,
+    commonsPlus.commons.capacityPerUser,
   "commons.carryingCapacity": (commonsPlus) =>
     commonsPlus.commons?.carryingCapacity,
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'capacityPerUser')

[Killed] ArrowFunction
main/components/Commons/commonsTableUtils.js:73:31
   totalCows: (commonsPlus) => commonsPlus.totalCows,
   "commons.capacityPerUser": (commonsPlus) =>
     commonsPlus.commons?.capacityPerUser,
-  "commons.carryingCapacity": (commonsPlus) =>
-    commonsPlus.commons?.carryingCapacity,
+  "commons.carryingCapacity": () => undefined,
   effectiveCapacity: computeEffectiveCapacity,
 };
killedBy: commonsTableUtils additional coverage getSortableValue handles exhaustive numeric, boolean, and date branches
statusReason: expected null to be 10 // Object.is equality
