[Killed] OptionalChaining
main/components/Commons/commonsTableUtils.js:74:5
   "commons.capacityPerUser": (commonsPlus) =>
     commonsPlus.commons?.capacityPerUser,
   "commons.carryingCapacity": (commonsPlus) =>
-    commonsPlus.commons?.carryingCapacity,
+    commonsPlus.commons.carryingCapacity,
   effectiveCapacity: computeEffectiveCapacity,
 };
killedBy: commonsTableUtils additional coverage getSortableValue handles falsy commons object safely
statusReason: Cannot read properties of undefined (reading 'carryingCapacity')

[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:78:52
   effectiveCapacity: computeEffectiveCapacity,
 };
 
-export function getSortableValue(commonsPlus, key) {
-  if (!commonsPlus) return null;
-  const resolver = sortableValueResolvers[key];
-  if (!resolver) return null;
-
-  const val = resolver(commonsPlus);
-
-  if (NUMERIC_SORT_KEYS.has(key)) {
-    if (val == null || val === "") return null;
-    const n = Number(val);
-    return Number.isFinite(n) ? n : null;
-  }
-
-  // For string/date/boolean fields, return as-is (or empty string for missing names/dates)
-  if (STRING_DEFAULT_EMPTY_KEYS.has(key)) return val ?? "";
-
-  return val ?? null;
-}
+export function getSortableValue(commonsPlus, key) {}
 
 export function compareAsStrings(aVal, bVal, directionMultiplier) {
killedBy: commonsTableUtils helpers getSortableValue handles null row
statusReason: expected undefined to be null

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:79:7
 };
 
 export function getSortableValue(commonsPlus, key) {
-  if (!commonsPlus) return null;
+  if (true) return null;
   const resolver = sortableValueResolvers[key];
   if (!resolver) return null;
killedBy: commonsTableUtils helpers getSortableValue returns id and name
statusReason: expected null to be 7 // Object.is equality

[Killed] BooleanLiteral
main/components/Commons/commonsTableUtils.js:79:7
 };
 
 export function getSortableValue(commonsPlus, key) {
-  if (!commonsPlus) return null;
+  if (commonsPlus) return null;
   const resolver = sortableValueResolvers[key];
   if (!resolver) return null;
killedBy: commonsTableUtils helpers getSortableValue handles null row
statusReason: Cannot read properties of null (reading 'commons')

[Killed] BooleanLiteral
main/components/Commons/commonsTableUtils.js:81:7
 export function getSortableValue(commonsPlus, key) {
   if (!commonsPlus) return null;
   const resolver = sortableValueResolvers[key];
-  if (!resolver) return null;
+  if (resolver) return null;
 
   const val = resolver(commonsPlus);
killedBy: commonsTableUtils helpers getSortableValue returns id and name
statusReason: expected null to be 7 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:81:7
 export function getSortableValue(commonsPlus, key) {
   if (!commonsPlus) return null;
   const resolver = sortableValueResolvers[key];
-  if (!resolver) return null;
+  if (true) return null;
 
   const val = resolver(commonsPlus);
killedBy: commonsTableUtils helpers getSortableValue returns id and name
statusReason: expected null to be 7 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:85:7
 
   const val = resolver(commonsPlus);
 
-  if (NUMERIC_SORT_KEYS.has(key)) {
+  if (false) {
     if (val == null || val === "") return null;
     const n = Number(val);
killedBy: commonsTableUtils helpers getSortableValue parses numeric fields and handles invalid values
statusReason: expected '5.5' to be 5.5 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:85:7
 
   const val = resolver(commonsPlus);
 
-  if (NUMERIC_SORT_KEYS.has(key)) {
+  if (true) {
     if (val == null || val === "") return null;
     const n = Number(val);
killedBy: commonsTableUtils helpers getSortableValue returns id and name
statusReason: expected null to be 'Seven' // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:86:24
   const val = resolver(commonsPlus);
 
   if (NUMERIC_SORT_KEYS.has(key)) {
-    if (val == null || val === "") return null;
+    if (val == null || false) return null;
     const n = Number(val);
     return Number.isFinite(n) ? n : null;
killedBy: commonsTableUtils additional coverage getSortableValue normalizes effectiveCapacity edge cases
statusReason: expected +0 to be null

[Killed] LogicalOperator
main/components/Commons/commonsTableUtils.js:86:9
   const val = resolver(commonsPlus);
 
   if (NUMERIC_SORT_KEYS.has(key)) {
-    if (val == null || val === "") return null;
+    if (val == null && val === "") return null;
     const n = Number(val);
     return Number.isFinite(n) ? n : null;
killedBy: commonsTableUtils additional coverage getSortableValue normalizes effectiveCapacity edge cases
statusReason: expected +0 to be null

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:92:7
   }
 
   // For string/date/boolean fields, return as-is (or empty string for missing names/dates)
-  if (STRING_DEFAULT_EMPTY_KEYS.has(key)) return val ?? "";
+  if (false) return val ?? "";
 
   return val ?? null;
killedBy: commonsTableUtils additional coverage getSortableValue handles exhaustive numeric, boolean, and date branches
statusReason: expected null to be '' // Object.is equality

[Killed] LogicalOperator
main/components/Commons/commonsTableUtils.js:92:50
   }
 
   // For string/date/boolean fields, return as-is (or empty string for missing names/dates)
-  if (STRING_DEFAULT_EMPTY_KEYS.has(key)) return val ?? "";
+  if (STRING_DEFAULT_EMPTY_KEYS.has(key)) return val && "";
 
   return val ?? null;
killedBy: commonsTableUtils helpers getSortableValue returns id and name
statusReason: expected '' to be 'Seven' // Object.is equality

[Killed] LogicalOperator
main/components/Commons/commonsTableUtils.js:94:10
   // For string/date/boolean fields, return as-is (or empty string for missing names/dates)
   if (STRING_DEFAULT_EMPTY_KEYS.has(key)) return val ?? "";
 
-  return val ?? null;
+  return val && null;
 }
 
killedBy: commonsTableUtils helpers getSortableValue returns id and name
statusReason: expected null to be 7 // Object.is equality

[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:97:67
   return val ?? null;
 }
 
-export function compareAsStrings(aVal, bVal, directionMultiplier) {
-  const cmp = String(aVal).localeCompare(String(bVal));
-  return directionMultiplier === -1 ? -cmp : cmp;
-}
+export function compareAsStrings(aVal, bVal, directionMultiplier) {}
 
 function compareAsNumbers(aNum, bNum, directionMultiplier) {
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:99:10
 
 export function compareAsStrings(aVal, bVal, directionMultiplier) {
   const cmp = String(aVal).localeCompare(String(bVal));
-  return directionMultiplier === -1 ? -cmp : cmp;
+  return true ? -cmp : cmp;
 }
 
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be less than 0

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:99:10
 
 export function compareAsStrings(aVal, bVal, directionMultiplier) {
   const cmp = String(aVal).localeCompare(String(bVal));
-  return directionMultiplier === -1 ? -cmp : cmp;
+  return directionMultiplier !== -1 ? -cmp : cmp;
 }
 
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be less than 0

[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:102:60
   return directionMultiplier === -1 ? -cmp : cmp;
 }
 
-function compareAsNumbers(aNum, bNum, directionMultiplier) {
-  if (aNum > bNum) return directionMultiplier;
-  if (aNum < bNum) return -directionMultiplier;
-  return 0;
-}
+function compareAsNumbers(aNum, bNum, directionMultiplier) {}
 
 export function createCommonsComparator(sortKey, sortDirection = "asc") {
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: actual value must be number or bigint, received "undefined"

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:103:7
 }
 
 function compareAsNumbers(aNum, bNum, directionMultiplier) {
-  if (aNum > bNum) return directionMultiplier;
+  if (aNum <= bNum) return directionMultiplier;
   if (aNum < bNum) return -directionMultiplier;
   return 0;
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be less than 0

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:103:7
 }
 
 function compareAsNumbers(aNum, bNum, directionMultiplier) {
-  if (aNum > bNum) return directionMultiplier;
+  if (aNum >= bNum) return directionMultiplier;
   if (aNum < bNum) return -directionMultiplier;
   return 0;
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be +0 // Object.is equality

[Killed] UnaryOperator
main/components/Commons/commonsTableUtils.js:104:27
 
 function compareAsNumbers(aNum, bNum, directionMultiplier) {
   if (aNum > bNum) return directionMultiplier;
-  if (aNum < bNum) return -directionMultiplier;
+  if (aNum < bNum) return +directionMultiplier;
   return 0;
 }
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be less than 0

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:104:7
 
 function compareAsNumbers(aNum, bNum, directionMultiplier) {
   if (aNum > bNum) return directionMultiplier;
-  if (aNum < bNum) return -directionMultiplier;
+  if (true) return -directionMultiplier;
   return 0;
 }
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected -1 to be +0 // Object.is equality

[Killed] StringLiteral
main/components/Commons/commonsTableUtils.js:108:66
   return 0;
 }
 
-export function createCommonsComparator(sortKey, sortDirection = "asc") {
+export function createCommonsComparator(sortKey, sortDirection = "") {
   if (sortDirection !== "asc" && sortDirection !== "desc") {
     throw new Error("Invalid sort direction; expected 'asc' or 'desc'");
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: Invalid sort direction; expected 'asc' or 'desc'

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:109:34
 }
 
 export function createCommonsComparator(sortKey, sortDirection = "asc") {
-  if (sortDirection !== "asc" && sortDirection !== "desc") {
+  if (sortDirection !== "asc" && sortDirection === "desc") {
     throw new Error("Invalid sort direction; expected 'asc' or 'desc'");
   }
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: Invalid sort direction; expected 'asc' or 'desc'

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:109:34
 }
 
 export function createCommonsComparator(sortKey, sortDirection = "asc") {
-  if (sortDirection !== "asc" && sortDirection !== "desc") {
+  if (sortDirection !== "asc" && true) {
     throw new Error("Invalid sort direction; expected 'asc' or 'desc'");
   }
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: Invalid sort direction; expected 'asc' or 'desc'

[Killed] StringLiteral
main/components/Commons/commonsTableUtils.js:110:21
 
 export function createCommonsComparator(sortKey, sortDirection = "asc") {
   if (sortDirection !== "asc" && sortDirection !== "desc") {
-    throw new Error("Invalid sort direction; expected 'asc' or 'desc'");
+    throw new Error("");
   }
   const directionMultiplier = sortDirection === "desc" ? -1 : 1;
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected [Function] to throw error matching /Invalid sort direction/ but got ''

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:112:31
   if (sortDirection !== "asc" && sortDirection !== "desc") {
     throw new Error("Invalid sort direction; expected 'asc' or 'desc'");
   }
-  const directionMultiplier = sortDirection === "desc" ? -1 : 1;
+  const directionMultiplier = true ? -1 : 1;
 
   return (a, b) => {
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be less than 0

[Killed] EqualityOperator
main/components/Commons/commonsTableUtils.js:112:31
   if (sortDirection !== "asc" && sortDirection !== "desc") {
     throw new Error("Invalid sort direction; expected 'asc' or 'desc'");
   }
-  const directionMultiplier = sortDirection === "desc" ? -1 : 1;
+  const directionMultiplier = sortDirection !== "desc" ? -1 : 1;
 
   return (a, b) => {
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be less than 0

[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:114:20
   }
   const directionMultiplier = sortDirection === "desc" ? -1 : 1;
 
-  return (a, b) => {
-    const aVal = getSortableValue(a, sortKey);
-    const bVal = getSortableValue(b, sortKey);
-
-    if (aVal == null) {
-      if (bVal == null) return 0;
-      return 1;
-    }
-
-    if (bVal == null) {
-      return -1;
-    }
-
-    const aNum = Number(aVal);
-    const bNum = Number(bVal);
-    if (Number.isFinite(aNum) && Number.isFinite(bNum)) {
-      return compareAsNumbers(aNum, bNum, directionMultiplier);
-    }
-
-    return compareAsStrings(aVal, bVal, directionMultiplier);
-  };
+  return (a, b) => {};
 }
 
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:118:9
     const aVal = getSortableValue(a, sortKey);
     const bVal = getSortableValue(b, sortKey);
 
-    if (aVal == null) {
+    if (false) {
       if (bVal == null) return 0;
       return 1;
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected -1 to be 1 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:118:9
     const aVal = getSortableValue(a, sortKey);
     const bVal = getSortableValue(b, sortKey);
 
-    if (aVal == null) {
+    if (true) {
       if (bVal == null) return 0;
       return 1;
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be less than 0

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:119:11
     const bVal = getSortableValue(b, sortKey);
 
     if (aVal == null) {
-      if (bVal == null) return 0;
+      if (false) return 0;
       return 1;
     }
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:119:11
     const bVal = getSortableValue(b, sortKey);
 
     if (aVal == null) {
-      if (bVal == null) return 0;
+      if (true) return 0;
       return 1;
     }
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
main/components/Commons/commonsTableUtils.js:123:23
       return 1;
     }
 
-    if (bVal == null) {
-      return -1;
-    }
+    if (bVal == null) {}
 
     const aNum = Number(aVal);
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be -1 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:123:9
       return 1;
     }
 
-    if (bVal == null) {
+    if (true) {
       return -1;
     }
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected -1 to be greater than 0

[Killed] UnaryOperator
main/components/Commons/commonsTableUtils.js:124:14
     }
 
     if (bVal == null) {
-      return -1;
+      return +1;
     }
 
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be -1 // Object.is equality

[Killed] LogicalOperator
main/components/Commons/commonsTableUtils.js:129:9
 
     const aNum = Number(aVal);
     const bNum = Number(bVal);
-    if (Number.isFinite(aNum) && Number.isFinite(bNum)) {
+    if (Number.isFinite(aNum) || Number.isFinite(bNum)) {
       return compareAsNumbers(aNum, bNum, directionMultiplier);
     }
killedBy: CommonsTablev2 component createCommonsComparator string-key both-null returns 0 and null-vs-nonnull ordering
statusReason: expected +0 to be -1 // Object.is equality

[Killed] ConditionalExpression
main/components/Commons/commonsTableUtils.js:129:9
 
     const aNum = Number(aVal);
     const bNum = Number(bVal);
-    if (Number.isFinite(aNum) && Number.isFinite(bNum)) {
+    if (false) {
       return compareAsNumbers(aNum, bNum, directionMultiplier);
     }
killedBy: commonsTableUtils additional coverage createCommonsComparator handles numeric, string, and missing values
statusReason: expected 1 to be less than 0
