[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:60:31
   );
   // Stryker restore all
 
-  const commonsPlusExists = !(typeof commonsPlus == "undefined");
+  const commonsPlusExists = !(true);
   let commonsforuser;
   let matched;
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element by: [data-testid="CommonsPlay"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] LogicalOperator
src/main/pages/PlayPage.jsx:69:19
     matched = commonsforuser.some((com) => com.id === commonsPlus.commons.id);
   }
 
-  const allowed = commonsPlusExists && matched;
+  const allowed = commonsPlusExists || matched;
   const notallowed = commonsPlusExists && !matched;
 
killedBy: PlayPage tests User that has not joined any commons is trying to access an unjoined common
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div
  class="woodentitle card"
  data-testid="commons-card"
>
  <div
    class="text-center border-0 my-3"

[Killed] BooleanLiteral
src/main/pages/PlayPage.jsx:70:43
   }
 
   const allowed = commonsPlusExists && matched;
-  const notallowed = commonsPlusExists && !matched;
+  const notallowed = commonsPlusExists && matched;
 
   // Stryker disable all
killedBy: PlayPage tests User that has joined one commons is trying to access an unjoined common
statusReason: Unable to find an element with the text: You have yet to join this commons!. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:178:12
         <Container>
           {!commonsPlus && <h1>This commons does not exist!</h1>}
           {notallowed && <h1>You have yet to join this commons!</h1>}
-          {allowed && !!currentUser && (
-            <CommonsPlay currentUser={currentUser} />
-          )}
+          {true}
           {allowed && (
             <div className="mt-3 mb-3">
killedBy: PlayPage tests Make sure that both the Announcements and Welcome Farmer components show up
statusReason: Unable to find an element by: [data-testid="CommonsPlay"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:181:12
           {allowed && !!currentUser && (
             <CommonsPlay currentUser={currentUser} />
           )}
-          {allowed && (
-            <div className="mt-3 mb-3">
-              <Button
-                variant="secondary"
-                onClick={() => navigate("/selectcommons")}
-                data-testid="select-another-commons-button"
-              >
-                Select Another Commons
-              </Button>
-            </div>
-          )}
+          {false}
 
           {!!commonsPlus && (
killedBy: PlayPage tests Select Another Commons button navigates to /selectcommons
statusReason: Unable to find an element by: [data-testid="select-another-commons-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ConditionalExpression
src/main/pages/PlayPage.jsx:181:12
           {allowed && !!currentUser && (
             <CommonsPlay currentUser={currentUser} />
           )}
-          {allowed && (
-            <div className="mt-3 mb-3">
-              <Button
-                variant="secondary"
-                onClick={() => navigate("/selectcommons")}
-                data-testid="select-another-commons-button"
-              >
-                Select Another Commons
-              </Button>
-            </div>
-          )}
+          {true}
 
           {!!commonsPlus && (
killedBy: PlayPage tests Select Another Commons button navigates to /selectcommons
statusReason: Unable to find an element by: [data-testid="select-another-commons-button"]

Ignored nodes: comments, script, style
<body
  class=""
  style="padding-right: 1024px;"
>
  <div>

[Killed] ArrowFunction
src/main/pages/PlayPage.jsx:185:26
             <div className="mt-3 mb-3">
               <Button
                 variant="secondary"
-                onClick={() => navigate("/selectcommons")}
+                onClick={() => undefined}
                 data-testid="select-another-commons-button"
               >
killedBy: PlayPage tests Select Another Commons button navigates to /selectcommons
statusReason: expected "spy" to be called with arguments: [ '/selectcommons' ]

Number of calls: 0
