[Killed] ArrowFunction
src/main/components/OurTable.jsx:45:29
     <div {...getTableProps()}>
       <Table style={tableStyle} {...getTableProps()} striped bordered hover>
         <thead>
-          {headerGroups.map((headerGroup) => (
-            <tr key={headerGroup.id} {...headerGroup.getHeaderGroupProps()}>
-              {headerGroup.headers.map((column) => (
-                <th 
-                  key={column.id}
-                  {...column.getHeaderProps(column.getSortByToggleProps())}
-                  data-testid={`${testid}-header-${column.id}`}
-                >
-                  {column.render("Header")}
-                  <span
-                    data-testid={`${testid}-header-${column.id}-sort-carets`}
-                  >
-                    {column.isSorted
-                      ? column.isSortedDesc
-                        ? " 🔽"
-                        : " 🔼"
-                      : ""}
-                  </span>
-                </th>
-              ))}
-            </tr>
-          ))}
+          {headerGroups.map(() => undefined)}
         </thead>
         <tbody {...getTableBodyProps()}>
killedBy: OurTable tests default testid is testId
statusReason: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ArrowFunction
src/main/components/OurTable.jsx:47:40
         <thead>
           {headerGroups.map((headerGroup) => (
             <tr key={headerGroup.id} {...headerGroup.getHeaderGroupProps()}>
-              {headerGroup.headers.map((column) => (
-                <th 
-                  key={column.id}
-                  {...column.getHeaderProps(column.getSortByToggleProps())}
-                  data-testid={`${testid}-header-${column.id}`}
-                >
-                  {column.render("Header")}
-                  <span
-                    data-testid={`${testid}-header-${column.id}-sort-carets`}
-                  >
-                    {column.isSorted
-                      ? column.isSortedDesc
-                        ? " 🔽"
-                        : " 🔼"
-                      : ""}
-                  </span>
-                </th>
-              ))}
+              {headerGroup.headers.map(() => undefined)}
             </tr>
           ))}
killedBy: OurTable tests default testid is testId
statusReason: Unable to find an element by: [data-testid="testid-header-col1"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
src/main/components/OurTable.jsx:71:27
         <tbody {...getTableBodyProps()}>
           {rows
             .slice(pageIndex * pageSize, (pageIndex + 1) * pageSize)
-            .map((row) => {
-              prepareRow(row);
-              return (
-                <tr key={row.id} {...row.getRowProps()}>
-                  {row.cells.map((cell, _index) => {
-                    return (
-                      <td
-                        key={cell.column.id}
-                        {...cell.getCellProps()}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                      >
-                        {cell.render("Cell")}
-                      </td>
-                    );
-                  })}
-                </tr>
-              );
-            })}
+            .map((row) => {})}
         </tbody>
       </Table>
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] BlockStatement
src/main/components/OurTable.jsx:75:52
               prepareRow(row);
               return (
                 <tr key={row.id} {...row.getRowProps()}>
-                  {row.cells.map((cell, _index) => {
-                    return (
-                      <td
-                        key={cell.column.id}
-                        {...cell.getCellProps()}
-                        data-testid={`${testid}-cell-row-${cell.row.index}-col-${cell.column.id}`}
-                      >
-                        {cell.render("Cell")}
-                      </td>
-                    );
-                  })}
+                  {row.cells.map((cell, _index) => {})}
                 </tr>
               );
killedBy: OurTable tests button appears in the table and triggers callback on click
statusReason: Unable to find an element by: [data-testid="testId-cell-row-0-col-Click-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:110:14
             {pageIndex > 4 && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
             )}
-            {pageIndex === 4 && (
-              <Pagination.Item
-                onClick={() => setPageIndex(pageIndex - 3)}
-                data-testid={`${testid}-back-three-page-button`}
-              >
-                {pageIndex - 2}
-              </Pagination.Item>
-            )}
+            {true}
             {pageIndex > 1 && (
               <Pagination.Item
killedBy: OurTable tests renders a table with 41 rows and moving forward and back three pages
statusReason: Unable to find an element by: [data-testid="testid-back-three-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >

[Killed] ConditionalExpression
src/main/components/OurTable.jsx:110:14
             {pageIndex > 4 && (
               <Pagination.Ellipsis data-testid={`${testid}-left-ellipsis`} />
             )}
-            {pageIndex === 4 && (
+            {true && (
               <Pagination.Item
                 onClick={() => setPageIndex(pageIndex - 3)}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality

[Killed] EqualityOperator
src/main/components/OurTable.jsx:118:14
                 {pageIndex - 2}
               </Pagination.Item>
             )}
-            {pageIndex > 1 && (
+            {pageIndex <= 1 && (
               <Pagination.Item
                 onClick={() => setPageIndex(pageIndex - 2)}
killedBy: OurTable tests renders a table with 51 rows and tests the first page
statusReason: expected <a class="page-link" …(4)></a> to be null // Object.is equality

[Killed] StringLiteral
src/main/components/OurTable.jsx:135:28
               </Pagination.Item>
             )}
             <Pagination.Item
-              data-testid={`${testid}-current-page-button`}
+              data-testid={``}
               // Stryker disable all
               active={true}
killedBy: OurTable tests renders a table with 11 rows and tests that pagination is visible when there are more rows than rows per page
statusReason: Unable to find an element by: [data-testid="testid-current-page-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      role="table"
    >
