[Killed] BlockStatement
src/main/pages/DeveloperPage.jsx:6:29
 import { Inspector } from "react-inspector";
 import { useSystemInfo } from "main/utils/systemInfo";
 
-const DeveloperPage = () => {
-  const { data: systemInfo } = useSystemInfo();
-
-  return (
-    <BasicLayout>
-      <h2>Developer Info</h2>
-      <p>This page is only visible to admin users.</p>
-
-      {systemInfo && (
-        <>
-          <h3>GitHub Repository</h3>
-          <p>
-            <a href={systemInfo.sourceRepo} target="_blank" rel="noreferrer">
-              {systemInfo.sourceRepo}
-            </a>
-          </p>
-
-          <h3>System Info (JSON)</h3>
-          <Inspector data={systemInfo} />
-        </>
-      )}
-    </BasicLayout>
-  );
-};
+const DeveloperPage = () => {};
 
 export default DeveloperPage;
killedBy: DeveloperPage tests renders Developer Info heading
statusReason: Unable to find an element with the text: Developer Info. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

[Killed] ConditionalExpression
src/main/pages/DeveloperPage.jsx:14:8
       <h2>Developer Info</h2>
       <p>This page is only visible to admin users.</p>
 
-      {systemInfo && (
-        <>
-          <h3>GitHub Repository</h3>
-          <p>
-            <a href={systemInfo.sourceRepo} target="_blank" rel="noreferrer">
-              {systemInfo.sourceRepo}
-            </a>
-          </p>
-
-          <h3>System Info (JSON)</h3>
-          <Inspector data={systemInfo} />
-        </>
-      )}
+      {false}
     </BasicLayout>
   );
killedBy: DeveloperPage tests renders Developer Info heading
statusReason: Unable to find an element with the text: https://github.com/ucsb-cs156/proj-happycows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/DeveloperPage.jsx:14:8
       <h2>Developer Info</h2>
       <p>This page is only visible to admin users.</p>
 
-      {systemInfo && (
-        <>
-          <h3>GitHub Repository</h3>
-          <p>
-            <a href={systemInfo.sourceRepo} target="_blank" rel="noreferrer">
-              {systemInfo.sourceRepo}
-            </a>
-          </p>
-
-          <h3>System Info (JSON)</h3>
-          <Inspector data={systemInfo} />
-        </>
-      )}
+      {true}
     </BasicLayout>
   );
killedBy: DeveloperPage tests renders Developer Info heading
statusReason: Unable to find an element with the text: https://github.com/ucsb-cs156/proj-happycows. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
