[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:87:18
       <button
         style={{
           backgroundColor: "#0d6efd",
-          color: "white",
+          color: "",
           borderColor: "#0d6efd",
           borderRadius: "8px",
killedBy: ChatDisplay tests renders page with reload & load without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- color: white;
+ color: ButtonText;

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:96:8
       >
         Reload messages.
       </button>
-      {Array.isArray(sortedMessages) &&
-        sortedMessages.slice(0, initialMessagePageSize).map((message) => (
-          <ChatMessageDisplay
-            key={message.id}
-            message={{
-              ...message,
-              username: userIdToUsername[message.userId],
-            }}
-          />
-        ))}
+      {true}
       <button
         style={{
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order on page 1
statusReason: expected '/api/usercommons/commons/all' to be '/api/chat/get' // Object.is equality

[Killed] ConditionalExpression
main/components/Chat/ChatDisplay.jsx:96:8
       >
         Reload messages.
       </button>
-      {Array.isArray(sortedMessages) &&
-        sortedMessages.slice(0, initialMessagePageSize).map((message) => (
-          <ChatMessageDisplay
-            key={message.id}
-            message={{
-              ...message,
-              username: userIdToUsername[message.userId],
-            }}
-          />
-        ))}
+      {false}
       <button
         style={{
killedBy: ChatDisplay tests displays three messages correctly with usernames in the correct order on page 1
statusReason: expected '/api/usercommons/commons/all' to be '/api/chat/get' // Object.is equality

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:110:24
         style={{
           backgroundColor: "#0d6efd",
           color: "white",
-          borderColor: "#0d6efd",
+          borderColor: "",
           borderRadius: "8px",
         }}
killedBy: ChatDisplay tests renders page with reload & load without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- borderColor: #0d6efd;

[Killed] ObjectLiteral
main/components/Chat/ChatDisplay.jsx:140:16
           />
         ))}
       <button
-        style={{
-          backgroundColor: "#0d6efd",
-          color: "white",
-          borderColor: "#0d6efd",
-          borderRadius: "8px",
-        }}
+        style={{}}
         data-testid="load-button"
         onClick={loadPages}
killedBy: ChatDisplay tests renders without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- backgroundColor: rgb(13, 110, 253);

[Killed] StringLiteral
main/components/Chat/ChatDisplay.jsx:141:28
         ))}
       <button
         style={{
-          backgroundColor: "#0d6efd",
+          backgroundColor: "",
           color: "white",
           borderColor: "#0d6efd",
killedBy: ChatDisplay tests renders without crashing
statusReason: expect(element).toHaveStyle()

- Expected
+ Received

- backgroundColor: rgb(13, 110, 253);
